#!/usr/bin/python
import re

paradigm_types = {
'N' : 'sg,nom/acc	sg,acc	sg,gen/acc	sg,dat	sg,loc	sg,ins	sg,voc	pl,nom	pl,acc	pl,gen/acc	pl,dat	pl,loc	pl,ins	du,nom/acc	du,gen/loc	du,dat/ins',
'A1' : 'plen,sg,m,nom/acc	brev,sg,m,nom/acc	brev,sg,n,nom/acc	brev,sg,m/n,gen/acc	brev,sg,m/n,dat	brev,sg,m/n,loc	plen/brev,sg,m/n,ins	brev,sg,f,nom	brev,sg,f,acc	brev,sg,f,nom	brev,sg,f,dat/loc	plen/brev,sg,f,ins	brev,pl,m,nom	brev,pl,m,acc|brev,pl,f,nom/acc	brev,pl,n,nom/acc	plen/brev,pl,gen/loc	plen/brev,pl,dat	plen/brev,pl,ins	brev,du,m,nom/acc	brev,du,n/f,nom/acc	brev,du,gen/loc	brev,du,dat/ins	plen,sg,m,nom/acc	plen,sg,n,nom/acc	plen,sg,m/n,gen	plen,sg,m,acc	plen,sg,m/n,dat	plen,sg,m/n,loc	plen,sg,f,nom	plen,sg,f,acc	plen,sg,f,gen	plen,sg,f,dat/loc	plen,pl,m,nom	plen,pl,m,acc|plen,pl,f,nom/acc	plen,pl,n,nom/acc	plen,du,m,nom/acc	plen,du,n/f,nom/acc	plen,du,gen/loc	plen/brev,du,dat/ins	comp1	comp2	brev,sg,m,voc	plen,pl,m,nom1',
'A2' : 'brev,sg,m,nom/acc	brev,sg,m,nom/acc	brev,sg,n,nom/acc	brev,sg,m/n,gen/acc	brev,sg,m/n,dat	brev,sg,m/n,loc	brev,sg,m/n,ins	brev,sg,f,nom	brev,sg,f,acc	brev,sg,f,nom	brev,sg,f,dat/loc	brev,sg,f,ins	brev,pl,m,nom	brev,pl,m,acc|brev,pl,f,nom/acc	brev,pl,n,nom/acc	brev,pl,gen/loc	brev,pl,dat	brev,pl,ins	brev,du,m,nom/acc	brev,du,n/f,nom/acc	brev,du,gen/loc	brev,du,dat/ins',
'PA1' : 'brev,sg,m,nom/acc	brev,sg,n,nom/acc	brev,sg,m/n,gen	brev,sg,m,acc	plen/brev,sg,m/n,dat	plen/brev,sg,m/n,loc	brev,sg,m/n,ins	brev,sg,f,nom	brev,sg,f,acc	brev,sg,f,gen	plen/brev,sg,f,dat/loc	plen/brev,sg,f,ins	brev,pl,m,nom	brev,pl,m,acc|brev,pl,f,nom/acc	brev,pl,n,nom/acc	brev,pl,gen/loc	brev,pl,dat	brev,pl,ins	brev,du,m,nom/acc	brev,du,n/f,nom/acc	brev,du,gen/loc	brev,du,dat/ins	plen,sg,m,nom/acc	plen,sg,n,nom/acc	plen,sg,m/n,gen	plen,sg,m,acc	-	plen,sg,m/n,ins	plen,sg,f,nom	plen,sg,f,acc	plen,sg,f,gen	plen,sg,f,dat/loc	plen,pl,m,nom	plen,pl,m,acc|plen,pl,f,nom/acc	plen,pl,n,nom/acc	plen,pl,gen/loc	plen,pl,dat	plen,pl,ins	plen,du,m,nom/acc	plen,du,n/f,nom/acc	plen,du,gen/loc	plen,du,dat/ins',
'PA2' : 'brev,sg,m,nom/acc	brev,sg,n,nom/acc	brev,sg,m/n,gen	brev,sg,m,acc	brev,sg,m/n,dat	brev,sg,m/n,loc	brev,sg,m/n,ins	brev,sg,f,nom	brev,sg,f,acc	brev,sg,f,gen	brev,sg,f,dat/loc	brev,sg,f,ins	brev,pl,m,nom	brev,pl,m,acc|brev,pl,f,nom/acc	brev,pl,n,nom/acc	brev,pl,gen/loc	brev,pl,dat	brev,pl,ins	brev,du,m,nom/acc	brev,du,n/f,nom/acc	brev,du,gen/loc	brev,du,dat/ins',
'PA2i' : 'sg,m,nom	sg,n,nom/acc	sg,m/n,gen	sg,m,acc	sg,m/n,dat	sg,m/n,loc	sg,m/n,ins	sg,f,nom	sg,f,acc	sg,f,gen	sg,f,dat/loc	sg,f,ins	pl,m/n,nom	pl,m,acc|pl,f,nom/acc	pl,n,acc	pl,gen/loc	pl,dat	pl,ins	du,nom	du,acc	du,gen/loc	du,dat/ins',
'PN' : 'nom	gen	acc	dat	loc	ins	acc,clit	dat,clit	du,nom	du,acc	du,gen/loc	du,dat/ins',
'NUM2' : 'm,nom/acc	n/f,nom/acc	gen/loc	dat/ins',
'NUM3' : 'nom/acc	gen/loc	dat	ins',
'#NUM' : 'sg,nom/acc	sg,gen	sg,dat	sg,loc	sg,ins	pl,nom/acc	pl,gen	pl,loc	pl,dat	pl,ins	du,nom/acc	du,gen/loc	du,dat/ins',
'NUMoe' : 'nom/acc	gen/loc	dat	ins	m/f,nom/acc	n,nom/acc',
'$A0' : 'sg,m	sg,f	sg,n	pl	du,m	du,n/f',
'$V0' : 'm?	f?',
'V' : 'inf	indic,praes,sg,1p	indic,praes,sg,2p	indic,praes,sg,3p	indic,praes,pl,1p	indic,praes,pl,2p	indic,praes,pl,3p	indic,praes,du,1p	indic,praes,du,2p/3p	imper,sg,2p/3p	imper,pl,2p	imper,pl,1p	imper,du,1p	imper,du,2p	indic,imperf,sg,1p	indic,imperf,sg,2p/3p	indic,imperf,pl,1p	indic,imperf,pl,2p	indic,imperf,pl,3p	indic,imperf,du,1p	indic,imperf,du,2p/3p	indic,aor,sg,1p	indic,aor,sg,2p/3p	indic,aor,pl,1p	indic,aor,pl,2p	indic,aor,pl,3p	indic,aor,du,1p	indic,aor,du,2p/3p	partcp,perf	partcp,perf,sg,m	partcp,praes,act,brev,sg,m/n,nom	partcp,praes,act	partcp,praet,act	partcp,praes,pass	partcp,praet,pass'
}

paradigms = {
'N1t' : {
    'type' : 'N',
    'core' : r'(.*)()()(ъ)',
    'inflex' : '',
    'flex' : 'ъ	=nom/=gen	а	у/ови	ѣ	омъ	е	и/ове	ы/=gen	ѡвъ/ъ^	ѡмъ/амъ	ѣхъ/ахъ	ы^/ми/ами	а^	у^	ома'
    },
'N1t*-a' : {
    'type' : 'N',
    'core' : r'(.*)(е)(л|н|т)(ъ)',
    'inflex' : '|е',
    'flex' : '2ъ	=nom/=gen	а	у/ови	ѣ	омъ	е	и/ове	ы/=gen	ѡвъ/ъ^	ѡмъ/амъ	ѣхъ/ахъ	ы^/ми/ами	а^	у^	ома'
    },
'N1t*-b' : {
    'type' : 'N',
    'core' : r'(.*)(е)(в|д)(ъ)',
    'inflex' : 'ь|е',
    'flex' : '2ъ	=nom/=gen	а	у/ови	ѣ	омъ	е	и/ове	ы/=gen	ѡвъ/ъ^	ѡмъ/амъ	ѣхъ/ахъ	ы^/ми/ами	а^	у^	ома'
    },
'N1t*-c' : {
    'type' : 'N',
    'core' : r'(.*)(о)(б|н|т|в|л|м)(ъ)',
    'inflex' : '|о',
    'flex' : '2ъ	=nom/=gen	а	у/ови	ѣ	омъ	е	и/ове	ы/=gen	ѡвъ/ъ^	ѡмъ/амъ	ѣхъ/ахъ	ы^/ми/ами	а^	у^	ома'
    },
'N1j' : {
	'type' : 'N',
    'core' : r'(.*)()()(ь)',
    'inflex' : '',
    'flex' : 'ь	=nom/=gen	я	ю/еви	и/ѣ	емъ	ю	и/еве/іе/е/є	и/=gen	ей/ь^	ємъ/ямъ	ехъ/ѣхъ/яхъ	и^/ьми/ми/ями	я^	ю^	ема'
    },
'N1j*-a' : {
	'type' : 'N',
	'core' : r'(.*)(е)(л|н)(ь)',
	'inflex' : '|е',
	'flex' : '2ь	=nom/=gen	я	ю/еви	и/ѣ	емъ	ю	и/еве/іе	и/=gen	ей/ь^	ємъ/ямъ	ехъ/ѣхъ/яхъ	и^/ьми/ми/ями	я^	ю^	ема'
	},
'N1j*-b' : {
	'type' : 'N',
	'core' : r'(.*)(о)(т|р|л|н)(ь)',
	'inflex' : '|о',
	'flex' : '2ь	=nom/=gen	я	ю/еви	и/ѣ	емъ	ю	и/еве/іе	и/=gen	ей/ь^	ємъ/ямъ	ехъ/ѣхъ/яхъ	и^/ьми/ми/ями	я^	ю^	ема'
	},
'N1je' : {
	'type' : 'N',
	'core' : r'(.*)()(л|р)(ь)',
	'inflex' : '',
	'flex' : 'ь	=nom/=gen	я	ю/еви	и/ѣ	емъ	ю	и/еве/іе/е/є	и/=gen	ей	ємъ/ямъ	ехъ/ѣхъ/яхъ	и^/ьми/ми/ями	я^	ю^	ема'
	},
'N1k' : {
	'type' : 'N',
	'core' : r'(.*)(к)()(ъ)',
	'inflex' : 'к|ц|ч',
	'flex' : 'ъ	=nom/=gen	а	у/ови	2ѣ/ѣ	омъ	3е/е	2ы/2ы^	и/=gen	ѡвъ/ъ^	ѡмъ/амъ	2ѣхъ/ахъ	и^/ами	а^	у^	ома'
	},
'N1g' : {
	'type' : 'N',
	'core' : r'(.*)(г)()(ъ)',
	'inflex' : 'г|з|ж',
	'flex' : 'ъ	=nom/=gen	а	у/ови	2ѣ/ѣ	омъ	3е/е	2и	и/=gen	ѡвъ/ъ^	ѡмъ/амъ	2ѣхъ/ахъ	и^/ами	а^	у^	ома'
	},
'N1h' : {
	'type' : 'N',
	'core' : r'(.*)(х)()(ъ)',
	'inflex' : 'х|с|ш',
	'flex' : 'ъ	=nom/=gen	а	у/ови	2ѣ/ѣ	омъ	3е/е	2и	и/=gen	ѡвъ/ъ^	ѡмъ/амъ	2ѣхъ/ахъ	и^/ами	а^	у^	ома'	
	},
'N1k*-a' : {
	'type' : 'N',
	'core' : r'(.*)(ок)()(ъ)',
	'inflex' : 'к|ок|ц|ч',
	'flex' : '2ъ	=nom/=gen	а	у/ови	3ѣ/ѣ	омъ	4е	3ы	и/=gen	ѡвъ/2ъ^	ѡмъ/амъ	3ѣхъ/ахъ	и^/ами	а^	у^	ома'	
	},
'N1k*-b' : {
	'type' : 'N',
	'core' : r'(.*)(ек)()(ъ)',
	'inflex' : 'ьк|ек|ьц|ьч',
	'flex' : '2ъ	=nom/=gen	а	у/ови	3ѣ/ѣ	омъ	4е	3ы	и/=gen	ѡвъ/2ъ^	ѡмъ/амъ	3ѣхъ/ахъ	и^/ами	а^	у^	ома'	
	},
'N1k*-c' : {
	'type' : 'N',
	'core' : r'(.*)(ек)()(ъ)',
	'inflex' : 'йк|ек|йц|йч',
	'flex' : '2ъ	=nom/=gen	а	у/ови	3ѣ/ѣ	омъ	4е	3ы	и/=gen	ѡвъ/2ъ^	ѡмъ/амъ	3ѣхъ/ахъ	и^/ами	а^	у^	ома'	
	},
'N1s' : {
	'type' : 'N',
	'core' : r'(.*)()(ш|ж)(ъ)',
	'inflex' : '',
	'flex' : 'ъ	=nom/=gen	а	у/еви	и/ѣ	емъ	у	и/іе/еве	ы/=gen	ей/ъ^	ємъ/амъ	ехъ/ахъ	ы^/ми/ами	а^	у^	ема'	
},
'N1sj' : {
	'type' : 'N',
	'core' : r'(.*)()(ч|щ)(ь)',
	'inflex' : '',
	'flex' : 'ь	=nom/=gen	а	у/еви	и/ѣ	емъ	у	и/іе/еве	и/=gen	ей/ь^	ємъ/амъ	ехъ/ахъ	и^/ьми/ми/ами	а^	у^	ема'	
},
'N1c' : {
	'type' : 'N',
	'core' : r'(.*)(ц)()(ъ)',
	'inflex' : 'ц|ч',
	'flex' : 'ъ	=nom/=gen	а	у/еви	ѣ	емъ	2е	ы	ы/=gen	євъ/ѡвъ/ъ^/ей	ємъ/амъ	ѣхъ/ахъ	ы^/ами	а^	у^	ема'	
	},
'N1c*-a' : {
	'type' : 'N',
	'core' : r'(.*)(ец)()(ъ)',
	'inflex' : 'ц|ец|ч',
	'flex' : '2ъ	=nom/=gen	а	у/еви	ѣ	емъ	3е	ы	ы/=gen	євъ/ѡвъ/ъ^/ей	ємъ/амъ	ѣхъ/ахъ	ы^/ами	а^	у^	ема'	
	},
'N1c*-b' : {
	'type' : 'N',
	'core' : r'(.*)(ец)()(ъ)',
	'inflex' : 'йц|ец|йч',
	'flex' : '2ъ	=nom/=gen	а	у/еви	ѣ	емъ	3е	ы	ы/=gen	євъ/ѡвъ/ъ^/ей	ємъ/амъ	ѣхъ/ахъ	ы^/ами	а^	у^	ема'	
	},
'N1c*-c' : {
	'type' : 'N',
	'core' : r'(.*)(ец)()(ъ)',
	'inflex' : 'ьц|ец|ьч',
	'flex' : '2ъ	=nom/=gen	а	у/еви	ѣ	емъ	3е	ы	ы/=gen	євъ/ѡвъ/ъ^/ей	ємъ/амъ	ѣхъ/ахъ	ы^/ами	а^	у^	ема'	
	},
'N1a' : {
	'type' : 'N',
	'core' : r'(.*)()()(й)',
	'inflex' : '',
	'flex' : 'й	=nom/=gen	я	ю/еви	и/ѣ	емъ	ю/е	и^/еве/є	и^/=gen	євъ/й^	ємъ/ямъ	ехъ/яхъ	и^/йми/ями	я^	ю^	ема'
	},
'N1i' : {
	'type' : 'N',
	'core' : r'(.*)()()(й)',
	'inflex' : '',
	'flex' : 'й	=nom/=gen	а/я	ю/еви	и	емъ	е	и^/еве/є	и^/=gen	євъ/ѡвъ	ємъ/ѡмъ/ямъ	ехъ/ахъ/яхъ	и^/йми/ями	я^/а^	ю^	ема'
},
'N1e' : {
	'type' : 'N',
	'core' : r'(.*)()()(й)',
	'inflex' : '',
	'flex' : 'й	=nom/=gen	а/я	ю/еви	и	емъ	е	и^/еве/є	и^/=gen	євъ/ѡвъ	ємъ/ѡмъ/ямъ	ехъ/ахъ/яхъ	и^/йми/ями	я^/а^	ю^	ема'
},
'N1in' : {
	'type' : 'N',
	'core' : r'(.*)()()(инъ)',
	'inflex' : '',
	'flex' : 'инъ	=nom/=gen	ина	ину	инѣ	иномъ	ине	е	ы/=gen	ъ/ѡвъ	ѡмъ/амъ	ѣхъ	ы^	а^	у^	ома'
},
#____________________________________________________________________________________________________________________________________
'N2t' : {
	'type' : 'N',
	'core' : r'(.*)()()(о)',
	'inflex' : '',
	'flex' : 'о	=nom	а	у	ѣ	омъ	=nom	а^	=nom	ъ	ѡмъ/амъ	ѣхъ/ахъ	ы/ами	ѣ^	у^	ома'
},
'N2t*-a' : {
	'type' : 'N',
	'core' : r'(.*)()(н|л)(о)',
	'inflex' : '|о',
	'flex' : 'о	=nom	а	у	ѣ	омъ	=nom	а^	=nom	2ъ	ѡмъ/амъ	ѣхъ/ахъ	ы/ами	ѣ^	у^	ома'
},
'N2t*-b' : {
	'type' : 'N',
	'core' : r'(.*)()(н|л)(о)',
	'inflex' : '|е',
	'flex' : 'о	=nom	а	у	ѣ	омъ	=nom	а^	=nom	2ъ	ѡмъ/амъ	ѣхъ/ахъ	ы/ами	ѣ^	у^	ома'
},
'N2t*-c' : {
	'type' : 'N',
	'core' : r'(.*)(ь)(м)(о)',
	'inflex' : 'ь|е',
	'flex' : 'о	=nom	а	у	ѣ	омъ	=nom	а^	=nom	2ъ	ѡмъ/амъ	ѣхъ/ахъ	ы/ами	ѣ^	у^	ома'
	},
'N2j' : {
	'type' : 'N',
	'core' : r'(.*)()()(е)',
	'inflex' : '',
	'flex' : 'е	=nom	я	ю	и/ѣ	емъ	=nom	я^	=nom	ей	ємъ/ямъ	яхъ/ехъ	и^/ями	и^	ю^	ема'
	},
'N2k' : {
	'type' : 'N',
	'core' : r'(.*)(к)()(о)',
	'inflex' : 'к|ц',
	'flex' : 'о	=nom	а	у	2ѣ/ѣ	омъ	=nom	а^	=nom	ъ	ѡмъ/амъ	2ѣхъ/ахъ	и^/ами	2ѣ^	у^	ома'
},
'N2g' : {
	'type' : 'N',
	'core' : r'(.*)(г)()(о)',
	'inflex' : 'г|з',
	'flex' : 'о	=nom	а	у	2ѣ/ѣ	омъ	=nom	а^	=nom	ъ	ѡмъ/амъ	2ѣхъ/ахъ	и^/ами	2ѣ^	у^	ома'
	},
'N2h' : {
	'type' : 'N',
	'core' : r'(.*)(х)()(о)',
	'inflex' : 'х|с',
	'flex' : 'о	=nom	а	у	2ѣ/ѣ	омъ	=nom	а^	=nom	ъ	ѡмъ/амъ	2ѣхъ/ахъ	и^/ами	2ѣ^	у^	ома'
	},
'N2s' : {
	'type' : 'N',
	'core' : r'(.*)()(щ|ж|ч)(е)',
	'inflex' : '',
	'flex' : 'е	=nom	а	у	и/ѣ	емъ	=nom	а^	=nom	ъ	ємъ/амъ	ахъ/exъ/ихъ	и^/ами	и^	ю^	ема'
	},
'N2c' : {
	'type' : 'N',
	'core' : r'(.*)()(ц)(е)',
	'inflex' : '',
	'flex' : 'е	=nom	а	у	ѣ/ы	емъ	=nom	а^	=nom	ъ	ємъ/амъ	ахъ/ехъ	ы^/ами	ы^	у^	ема'
	},
'N2c*-a' : {
	'type' : 'N',
	'core' : r'(.*)(ц)()(е)',
	'inflex' : 'ц|ец',
	'flex' : 'е	=nom	а	у	ѣ/ы	емъ	=nom	а^	=nom	2ъ	ємъ/амъ	ахъ/ехъ	ы^/ами	ы^	у^	ема'
	},
'N2c*-b' : {
	'type' : 'N',
	'core' : r'(.*)(ьц)()(е)',
	'inflex' : 'ьц|ец',
	'flex' : 'е	=nom	а	у	ѣ/ы	емъ	=nom	а^	=nom	2ъ	ємъ/амъ	ахъ/ехъ	ы^/ами	ы^	у^	ема'
	},
'N2i' : {
	'type' : 'N',
	'core' : r'(.*)(i)()(е)',
	'inflex' : 'i|',
	'flex' : 'е	=nom	я	ю	и	емъ	=nom	я^	=nom	й	ємъ/ямъ	ихъ/ахъ/яхъ	и^/2ьми/2ми/ями	и^	ю^	ема'
	},
'N2e' : {
	'type' : 'N',
	'core' : r'(.*)(i)()(е)',
	'inflex' : 'i|',
	'flex' : 'е	=nom	а/я	ю	и	емъ	=nom	я^	=nom	й	ємъ/ямъ	ихъ/ахъ/яхъ	и^/2ьми/2ми/ями	и^	ю^	ема'
	},
#_________________________________________________________________________________________________________________	
'N3t' : {
	'type' : 'N',
	'core' : r'(.*)()()(а)',
	'inflex' : '',
	'flex' : 'а	у	ы	ѣ	ѣ	ою	о	ы^	=nom/=gen	ъ/ъ^	амъ	ахъ	ами	ѣ^	у^	ама'
	},
'N3t*-a' : {
	'type' : 'N',
	'core' : r'(.*)()(н|р|б)(а)',
	'inflex' : '|е',
	'flex' : 'а	у	ы	ѣ	ѣ	ою	о	ы^	=nom/=gen	2ъ	амъ	ахъ	ами	ѣ^	у^	ама'
	},
'N3t*-b' : {
	'type' : 'N',
	'core' : r'(.*)(ь)(б|м)(а)',
	'inflex' : 'ь|е',
	'flex' : 'а	у	ы	ѣ	ѣ	ою	о	ы^	=nom/=gen	2ъ	амъ	ахъ	ами	ѣ^	у^	ама'
	},
'N3j' : {
	'type' : 'N',
	'core' : r'(.*)()()(я)',
	'inflex' : '',
	'flex' : 'я	ю	и	и/ѣ	и/ѣ	ею	е	и^/я^	=nom/=gen	ь/ей	ямъ	яхъ	ями	и^	ю^	яма'
	},
'N3j*' : {
	'type' : 'N',
	'core' : r'(.*)()(л)(я)',
	'inflex' : '|е',
	'flex' : 'я	ю	и	и/ѣ	и/ѣ	ею	е	и^/я^	=nom/=gen	2ь/ей	ямъ	яхъ	ями	и^	ю^	яма'
	},
'N3k' : {
	'type' : 'N',
	'core' : r'(.*)(к)()(а)',
	'inflex' : 'к|ц',
	'flex' : 'а	у	и	2ѣ/ѣ	2ѣ/ѣ	ою	о	и^	=nom/=gen	ъ	амъ	ахъ	ами	2ѣ^	у^	ама'
	},
'N3g' : {
	'type' : 'N',
	'core' : r'(.*)(г)()(а)',
	'inflex' : 'г|з',
	'flex' : 'а	у	и	2ѣ/ѣ	2ѣ/ѣ	ою	о	и^	=nom/=gen	ъ	амъ	ахъ	ами	2ѣ^	у^	ама'
	},
'N3h' : {
	'type' : 'N',
	'core' : r'(.*)(х)()(а)',
	'inflex' : 'х|с',
	'flex' : 'а	у	и	2ѣ/ѣ	2ѣ/ѣ	ою	о	и^	=nom/=gen	ъ	амъ	ахъ	ами	2ѣ^	у^	ама'
	},
'N3k*-a' : {
	'type' : 'N',
	'core' : r'(.*)(к)()(а)',
	'inflex' : 'к|ок|ц',
	'flex' : 'а	у	и	3ѣ/ѣ	3ѣ/ѣ	ою	о	и^	=nom/=gen	2ъ/ей	амъ	ахъ	ами	3ѣ^	у^	ама'
	},
'N3k*-b' : {
	'type' : 'N',
	'core' : r'(.*)(йк)()(а)',
	'inflex' : 'йк|ек|йц',
	'flex' : 'а	у	и	3ѣ/ѣ	3ѣ/ѣ	ою	о	и^	=nom/=gen	2ъ/ей	амъ	ахъ	ами	3ѣ^	у^	ама'
	},
'N3k*-c' : {
	'type' : 'N',
	'core' : r'(.*)(ьк)()(а)',
	'inflex' : 'ьк|ек|ьц',
	'flex' : 'а	у	и	3ѣ/ѣ	3ѣ/ѣ	ою	о	и^	=nom/=gen	2ъ/ей	амъ	ахъ	ами	3ѣ^	у^	ама'
	},
'N3s' : {
	'type' : 'N',
	'core' : r'(.*)()(ж|ч|ш|щ)(а)',
	'inflex' : '',
	'flex' : 'а	у	и	и/ѣ	и/ѣ	ею	е	и^/ы	=nom/=gen	ъ/ей	амъ	ахъ	ами	и^	у^	ама'
	},
'N3c' : {
	'type' : 'N',
	'core' : r'(.*)()(ц)(а)',
	'inflex' : '',
	'flex' : 'а	у	ы	ѣ	ѣ	ею	е	ы^/а^	=nom/=gen	ъ	амъ	ахъ	ами	ы^	у^	ама'
	},
'N3c*-a' : {
	'type' : 'N',
	'core' : r'(.*)()(ц)(а)',
	'inflex' : '|е',
	'flex' : 'а	у	ы	ѣ	ѣ	ею	е	ы^/а^	=nom/=gen	2ъ	амъ	ахъ	ами	ы^	у^	ама'
	},
'N3c*-b' : {
	'type' : 'N',
	'core' : r'(.*)(ь)(ц)(а)',
	'inflex' : 'ь|е',
	'flex' : 'а	у	ы	ѣ	ѣ	ею	е	ы^/а^	=nom/=gen	2ъ	амъ	ахъ	ами	ы^	у^	ама'
	},
'N3c*-c' : {
	'type' : 'N',
	'core' : r'(.*)(й)(ц)(а)',
	'inflex' : 'й|е',
	'flex' : 'а	у	ы	ѣ	ѣ	ею	е	ы^/а^	=nom/=gen	2ъ	амъ	ахъ	ами	ы^	у^	ама'
	},
'N3a' : {
	'type' : 'N',
	'core' : r'(.*)()()(я)',
	'inflex' : '',
	'flex' : 'я	ю	и	и	и	ею	е	и^/я^	=nom/=gen	й	ямъ	яхъ	ями	и^	ю^	яма'
	},
'N3i' : {
	'type' : 'N',
	'core' : r'(.*)()()(я)',
	'inflex' : '',
	'flex' : 'я	ю	и	и	и	ею	е	и^/я^	=nom/=gen	й	ямъ/амъ	яхъ/ахъ	ями/ами	и^	ю^	яма/ама'
	},
'N3e' : {
	'type' : 'N',
	'core' : r'(.*)()()(а)',
	'inflex' : '',
	'flex' : 'а	ю	и	и	и	ею	е	и^/я^	=nom/=gen	й	ямъ/амъ	яхъ/ахъ	ями/ами	и^	ю^	яма/ама'
	},
#__________________________________________________________________________________________________________________
'N41' : {
	'type' : 'N',
	'core' : r'(.*)()()(ь)',
	'inflex' : '',
	'flex' : 'ь	=nom	и	и	и	ію	е	и^	=nom/=gen	ей	емъ	ехъ	ьми	и^	ію^	ема/ьма'
	},
'N42' : {
	'type' : 'N',
	'core' : r'(.*)()()(ь)',
	'inflex' : '',
	'flex' : 'ь	=nom	и	и	и	емъ	ь/и	іе	и^	ій/ей	ємъ	ехъ	ьми	и^	ію	ьма'
	},
'N43' : {
	'type' : 'N',
	'core' : r'(.*)()()(ь)',
	'inflex' : '',
	'flex' : 'ь	=nom	е	и	и	емъ	=nom	и^	=nom	ій/ей	ємъ	ѣхъ	ьми	и^	ію	ема/ьма'
	},
'N43*' : {
	'type' : 'N',
	'core' : r'(.*)(е)(н)(ь)',
	'inflex' : '|е',
	'flex' : '2ь	=nom	е	и/еви	и	емъ	=nom	іе/и^	=nom	ій/ей	ємъ	ехъ	2ьми	и^	ію/ю^	2ьма'
	},
#_________________________________________________________________________________________________________________
'N5en' : {
	'type' : 'N',
	'core' : r'(.*)(я)()()',
	'inflex' : 'я|ен',
	'flex' : '1	=nom	2е	2и	2и	2емъ	=nom	2а	=nom	2ъ	2ємъ/2ѡмъ	2ѣхъ	2ы^/ми	2и^	2у^	2ема/2ама'
	},
'N5et' : {
	'type' : 'N',
	'core' : r'(.*)(я)()()',
	'inflex' : 'я|ят',
	'flex' : '1	=nom	2е	2и	2и	2емъ	=nom	2а	=nom	2ъ	2ємъ/2ѡмъ	2ѣхъ	2ы	2и^	2у^	2ема/2ама'
	},
'N5at' : {
	'type' : 'N',
	'core' : r'(.*)(а)()()',
	'inflex' : 'а|ат',
	'flex' : '1	=nom	2е	2и	2и	2емъ	=nom	2а	=nom	2ъ	2ємъ/2ѡмъ	2ѣхъ	2ы	2и^	2у^	2ема/2ама'
	},
'N5bes' : {
	'type' : 'N',
	'core' : r'(.*)(о)()()',
	'inflex' : 'о|ес',
	'flex' : '1	=nom	2е	2и	2и	2емъ	=nom	2а	=nom	2ъ	2ємъ	2ѣхъ	2ы	2и^	2у^	2ема'
	},
'N5hes' : {
	'type' : 'N',
	'core' : r'(.*)(хо)()()',
	'inflex' : 'хо|шес',
	'flex' : '1	=nom	2е	2и	2и	2емъ	=nom	2а	=nom	2ъ	2ємъ	2ѣхъ	2ы	2и^	2у^	2ема'
	},
'N5er' : {
	'type' : 'N',
	'core' : r'(.*)(и)()()',
	'inflex' : 'и|ер',
	'flex' : '1	2ь	2е	2и	2и	2ію	=nom	2и^	=nom/=gen	2ій/2ей	2емъ	2ехъ	2ьми	2и^	2ію^	2ема'
	},
'N5ov' : {
	'type' : 'N',
	'core' : r'(.*)(ы)()()',
	'inflex' : 'ы|ов',
	'flex' : '1	2ь	2е	2и	2и	2ію	=nom	2и^	=nom/=gen	2ей	2амъ	2ахъ	2ами	2и^	2ію^	2ама'
	},
'N5*ov' : {
	'type' : 'N',
	'core' : r'(.*)(о)(в)(ь)',
	'inflex' : '|о',
	'flex' : '2ь	=nom	е	и	и	2ію	=nom	2и^	=nom	ей	амъ	ахъ	ами	и^	2ію^	ама'
	},
#_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'A1sh' : {
	'type' : 'A1',
	'core' : r'(.*)()()()',
	'inflex' : '',
	'flex' : 'шій	шъ/шь	ше/шо	ша	шу	ши	шимъ	ши	шу	ши	ши	шею	ше	шя/шы	ша^	шихъ	шымъ	шими	ша^	шѣ^/шѣ	шую^	шема	шій/ый/ій	шее	шагѡ	шаго	шему	шемъ	шая	шую	шія	шей	шіи	шыя	шая^	шая^	шіи	шую^	шима	-	-	-	шіе'
	},
'A1sh*' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ъ|ь)',
	'inflex' : '',
	'flex' : 'шій	ъ/ь/шъ/шь	ше/шо	ша	шу	ши	шимъ	ши	шу	ши	ши	шею	ше	шя/шы	ша^	шихъ	шымъ	шими	ша^	шѣ^/шѣ	шую^	шема	шій/ый/ій	шее	шагѡ	шаго	шему	шемъ	шая	шую	шія	шей	шіи	шыя	шая^	шая^	шіи	шую^	шима	-	-	-	шіе'
	},
'A1t' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ый)',
	'inflex' : '',
	'flex' : 'ый	ъ/ь	о	а	у	ѣ	ымъ	а	у	ы	ѣ	ою	и	ы^	а^	ыхъ	ымъ^	ыми	а^	ѣ^	у^	ома	ый	ое	агѡ	аго	ому	ѣмъ/омъ	ая	ую	ыя	ѣй/ой	іи	ыя^	ая^	ая^	ѣи	ую^	ыма	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1t*-a' : {
	'type' : 'A1',
	'core' : r'(.*)()(н)(ый)',
	'inflex' : '|е',
	'flex' : 'ый	2ъ	о	а	у	ѣ	ымъ	а	у	ы	ѣ	ою	и	ы^	а^	ыхъ	ымъ^	ыми	а^	ѣ^	у^	ома	ый	ое	агѡ	аго	ому	ѣмъ/омъ	ая	ую	ыя	ѣй/ой	іи	ыя^	ая^	ая^	ѣи	ую^	ыма	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1t*-b' : {
	'type' : 'A1',
	'core' : r'(.*)(ь)(н)(ый)',
	'inflex' : 'ь|е',
	'flex' : 'ый	2ъ	о	а	у	ѣ	ымъ	а	у	ы	ѣ	ою	и	ы^	а^	ыхъ	ымъ^	ыми	а^	ѣ^	у^	ома	ый	ое	агѡ	аго	ому	ѣмъ/омъ	ая	ую	ыя	ѣй/ой	іи	ыя^	ая^	ая^	ѣи	ую^	ыма	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1t*-c' : {
	'type' : 'A1',
	'core' : r'(.*)(й)(н)(ый)',
	'inflex' : 'й|е',
	'flex' : 'ый	2ъ	о	а	у	ѣ	ымъ	а	у	ы	ѣ	ою	и	ы^	а^	ыхъ	ымъ^	ыми	а^	ѣ^	у^	ома	ый	ое	агѡ	аго	ому	ѣмъ/омъ	ая	ую	ыя	ѣй/ой	іи	ыя^	ая^	ая^	ѣи	ую^	ыма	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1t*-d' : {
	'type' : 'A1',
	'core' : r'(.*)(й)(н)(ый)',
	'inflex' : 'й|и',
	'flex' : 'ый	2ъ	о	а	у	ѣ	ымъ	а	у	ы	ѣ	ою	и	ы^	а^	ыхъ	ымъ^	ыми	а^	ѣ^	у^	ома	ый	ое	агѡ	аго	ому	ѣмъ/омъ	ая	ую	ыя	ѣй/ой	іи	ыя^	ая^	ая^	ѣи	ую^	ыма	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1t*-e' : {
	'type' : 'A1',
	'core' : r'(.*)()(л)(ый)',
	'inflex' : '|е',
	'flex' : 'ый	2ъ	о	а	у	ѣ	ымъ	а	у	ы	ѣ	ою	и	ы^	а^	ыхъ	ымъ^	ыми	а^	ѣ^	у^	ома	ый	ое	агѡ	аго	ому	ѣмъ/омъ	ая	ую	ыя	ѣй/ой	іи	ыя^	ая^	ая^	ѣи	ую^	ыма	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1t*-e' : {
	'type' : 'A1',
	'core' : r'(.*)()(л)(ый)',
	'inflex' : '|е',
	'flex' : 'ый	2ъ	о	а	у	ѣ	ымъ	а	у	ы	ѣ	ою	и	ы^	а^	ыхъ	ымъ^	ыми	а^	ѣ^	у^	ома	ый	ое	агѡ	аго	ому	ѣмъ/омъ	ая	ую	ыя	ѣй/ой	іи	ыя^	ая^	ая^	ѣи	ую^	ыма	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1n*' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ный)',
	'inflex' : '',
	'flex' : 'ный	ъ/енъ	о/но	а/на	у/ну	ѣ/нѣ	нымъ/ымъ	а/на	у/ну	ы/ны	ѣ/нѣ	ою/ною	и/ни	ы^/ны^	а^/на^	ныхъ/ыхъ	нымъ^/ымъ^	ыми/ными	а^/на^	ѣ^/нѣ^	у^/ну^	нома/ома	ный/ый	ное/ое	нагѡ/агѡ	наго/аго	ному/ому	нѣмъ/номъ/ѣмъ/омъ	ная/ая	ную/ую	ныя/ыя	нѣй/ной/ѣй/ой	ніи/іи	ныя^/ыя^	ная^/ая^	ная^/ая^	нѣи/ѣи	ную^/ую^	ныма/ыма	нѣй+$A1sh/ѣй+$A1sh	-	не/е	ніе/іе'
	},
'A1j' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ій)',
	'inflex' : '',
	'flex' : 'ій	ь	е	я	ю	и/ѣ	имъ/ѣмъ	я	ю	и	и/ѣ	ею	и^	и^	я	ихъ	имъ^	ими	я^	и^	ю^	ема	ій	ее	ягѡ	яго	ему	емъ	яя	юю	ія	ей/ѣй	іи	ія^	яя^	яя^	іи	юю^	има	ѣй+$A1sh	ь+$A1sh	е	іе'
	},
'A1j*-a' : {
	'type' : 'A1',
	'core' : r'(.*)()(н)(ій)',
	'inflex' : '|е',
	'flex' : 'ій	2ь/2ъ	е	я	ю	и/ѣ	имъ/ѣмъ	я	ю	и	и/ѣ	ею	и^	и^	я	ихъ	имъ^	ими	я^	и^	ю^	ема	ій	ее	ягѡ	яго	ему	емъ	яя	юю	ія	ей/ѣй	іи	ія^	яя^	яя^	іи	юю^	има	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1j*-b' : {
	'type' : 'A1',
	'core' : r'(.*)()(н)(ій)',
	'inflex' : 'ь|е',
	'flex' : 'ій	2ь/2ъ	е	я	ю	и/ѣ	имъ/ѣмъ	я	ю	и	и/ѣ	ею	и^	и^	я	ихъ	имъ^	ими	я^	и^	ю^	ема	ій	ее	ягѡ	яго	ему	емъ	яя	юю	ія	ей/ѣй	іи	ія^	яя^	яя^	іи	юю^	има	ѣй+$A1sh	$A1sh	е	іе'
	},
'A1k' : {
	'type' : 'A1',
	'core' : r'(.*)(к)()(ій)',
	'inflex' : 'к|ц|ч',
	'flex' : 'ій	ъ	о	а	у	2ѣ	имъ	а	у	и	2ѣ	ою	2ы/2и	и^	а^	ихъ	имъ^	ими	а^	2ѣ^	у^	ома	ій	ое	агѡ	аго	ому	2ѣмъ/омъ	ая	ую	ія	2ѣй/2ей/ой	2ыи/2іи/іи	ія^	ая^	ая^	2ѣи	ую^	има	3ай+$A1sh	-	3е	іе'
	},
'A1sk' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ій)',
	'inflex' : 'ск|ст|#сч',
	'flex' : 'ій	ъ	о	а	у	2ѣ	имъ	а	у	и	2ѣ	ою	2ы/2и	и^	а^	ихъ	имъ^	ими	а^	2ѣ^	у^	ома	ій	ое	агѡ	аго	ому	2ѣмъ/омъ	ая	ую	ія	2ѣй/2ей/ой	2ыи/2іи/іи	ія^	ая^	ая^	2ѣи	ую^	има	3ай+$A1sh	-	3е	іе'
	},
'A1ck' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ій)',
	'inflex' : 'цк|цт|#цч',
	'flex' : 'ій	ъ	о	а	у	2ѣ	имъ	а	у	и	2ѣ	ою	2ы/2и	и^	а^	ихъ	имъ^	ими	а^	2ѣ^	у^	ома	ій	ое	агѡ	аго	ому	2ѣмъ/омъ	ая	ую	ія	2ѣй/2ей/ой	2ыи/2іи/іи	ія^	ая^	ая^	2ѣи	ую^	има	3ай+$A1sh	-	3е	іе'
	},
'A1g' : {
	'type' : 'A1',
	'core' : r'(.*)(г)()(ій)',
	'inflex' : 'г|з|ж',
	'flex' : 'ій	ъ	о	а	у	2ѣ	имъ	а	у	и	2ѣ	ою	2и	и^	а^	ихъ	имъ^	ими	а^	2ѣ^	у^	ома	ій	ое	агѡ	аго	ому	2ѣмъ/омъ	ая	ую	ія	2ѣй/2ей/ой	2іи/іи	ія^	ая^	ая^	2ѣи	ую^	има	3ай+$A1sh	-	3е	іе'
	},
'A1h' : {
	'type' : 'A1',
	'core' : r'(.*)(х)()(ій)',
	'inflex' : 'х|с|ш',
	'flex' : 'ій	ъ	о	а	у	2ѣ	имъ	а	у	и	2ѣ	ою	2и	и^	а^	ихъ	имъ^	ими	а^	2ѣ^	у^	ома	ій	ое	агѡ	аго	ому	2ѣмъ/омъ	ая	ую	ія	2ѣй/2ей/ой	2іи/іи	ія^	ая^	ая^	2ѣи	ую^	има	3ай+$A1sh	-	3е	іе'
	},
'A1k*-a' : {
	'type' : 'A1',
	'core' : r'(.*)(к)()(ій)',
	'inflex' : 'к|ок|ц|ч',
	'flex' : 'ій	2ъ	о	а	у	3ѣ	имъ	а	у	и	3ѣ	ою	3ы	и^	а^	ихъ	имъ^	ими	а^	3ѣ^	у^	ома	ій	ое	агѡ	аго	ому	3ѣмъ/омъ	ая	ую	ія	3ѣй/3ей/ой	3ыи/2іи/іи	ія^	ая^	ая^	3ѣи	ую^	има	4ай+$A1sh	-	4е	іе'
	},
'A1k*-b' : {
	'type' : 'A1',
	'core' : r'(.*)(к)()(ій)',
	'inflex' : 'к|ек|ц|ч',
	'flex' : 'ій	2ъ	о	а	у	3ѣ	имъ	а	у	и	3ѣ	ою	3ы	и^	а^	ихъ	имъ^	ими	а^	3ѣ^	у^	ома	ій	ое	агѡ	аго	ому	3ѣмъ/омъ	ая	ую	ія	3ѣй/3ей/ой	3ыи/2іи/іи	ія^	ая^	ая^	3ѣи	ую^	има	4ай+$A1sh	-	4е	іе'
	},
'A1k*-c' : {
	'type' : 'A1',
	'core' : r'(.*)(к)()(ій)',
	'inflex' : 'ьк|ек|ц|ч',
	'flex' : 'ій	2ъ	о	а	у	3ѣ	имъ	а	у	и	3ѣ	ою	3ы	и^	а^	ихъ	имъ^	ими	а^	3ѣ^	у^	ома	ій	ое	агѡ	аго	ому	3ѣмъ/омъ	ая	ую	ія	3ѣй/3ей/ой	3ыи/2іи/іи	ія^	ая^	ая^	3ѣи	ую^	има	4ай+$A1sh	-	4е	іе'
	},
'A1s' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ій)',
	'inflex' : '',
	'flex' : 'ій	ь/ъ	е/о	а	у	и	имъ	а	у	и	и	ею	и^	и/ы	я	ихъ	имъ^/ымъ	ими	а^	и^	у^	ема	ій	ее	агѡ	аго	ему	емъ	ая	ую	ія	ей	іи	ыя	ая^	ая^	іи	ую^	има	ай+$A1sh	-	-	іе'
	},
'A1sx' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ій)',
	'inflex' : '',
	'flex' : 'ій	ъ/ь	е/о	а	у	емъ	имъ	и	у	и	и	ею	е	я/ы	а^	ихъ	имъ^/ымъ	ими	а^	ѣ^/ѣ	ую^	ема	ій	ее	агѡ	аго	ему	емъ	ая	ую	ія	ей	іи	ыя	ая^	ая^	іи	ую^	има	-	-	-	іе'
	},
'A1a' : {
	'type' : 'A1',
	'core' : r'(.*)()()(ій)',
	'inflex' : '',
	'flex' : 'ій	й	е	я	ю	и	имъ	я	ю	и	и	ею	и^	и	я	ихъ	имъ^	ими	я^	и^	ю^	ема	ій	ее	ягѡ	яго	ему	емъ	яя	юю	ія	ей	іи	ія^	яя^	яя^	іи	юю^	има	яй+$A1sh	-	е	іе'
	},
'A2i' : {
	'type' : 'A1',
	'core' : r'(.*)()()(й)',
	'inflex' : '',
	'flex' : '-	й	е	я	ю	и	имъ	я	ю	и	и	ею	и^	и	я	ихъ	имъ^	ими	я^	и^	ю^	ема	-	-	ягѡ	яго	ему	емъ	-	-	-	ей	-	-	-	-	-	-	има	-	-	-	-'
	},
#_______________________________________________________________________________________________________________________________________________________________________________________________________________________________
'A2t' : {
	'type' : 'A2',
	'core' : r'(.*)()()(ъ)',
	'inflex' : '',
	'flex' : 'ъ	ъ	о	а	у	ѣ/омъ	ымъ	а	у	ы	ѣ/ой	ою	ы/и	ы^	а^	ыхъ/ѣхъ	ымъ^	ы^/ыми	а^	ѣ^	у^	ыма/ома'
	},
'A2j' : {
	'type' : 'A2',
	'core' : r'(.*)()()(ь)',
	'inflex' : '',
	'flex' : 'ь	ь	е	я	ю	и/ѣ	имъ	я	ю	и	и/ѣ	ею	и^	и	я^	ихъ	имъ^	и^/ими	я^	и^	ю^	има/ема'
	},
'#A1j*' : {
	'type' : 'A2',
	'core' : r'(.*)()(н)(ій)',
	'inflex' : '|е',
	'flex' : 'ій	2ь	е	я	ю	и	имъ	я	ю	и	и	ею	и^	и	я	ихъ	имъ^	ими	я^	и^	ю^	има'
	},
'#A1s/A1i' : {
	'type' : 'A2',
	'core' : r'(.*)()(ч)(ій)',
	'inflex' : '|е',
	'flex' : '2ь	2ь	е	а	у	и	имъ	а	у	и	и	еу	и^	и	а	ихъ	имъ^	и^/ими	а^	и^	у^	има'
	},
#___________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'PA1' : {
	'type' : 'PA1',
	'core' : r'(.*)()()(ъ)',
	'inflex' : '',
	'flex' : 'ъ	о	огѡ	ого	ому	омъ	ѣмъ	а	у	оя	ой/ѣ	ою	и	ы^	а^	ѣхъ	ѣмъ^	ѣми	а^	ѣ^	ѡю	ѣма	ый	ое	агѡ	аго	-	ымъ	ая	ую	ыя	ѣй/ой	іи	ыя/ыя^	ая^	ыхъ	ымъ^	ыми	ая^	ѣи	ѡю	ыма'
	},
'PA1k' : {
	'type' : 'PA1',
	'core' : r'(.*)(к)()(ъ)',
	'inflex' : 'к|ц',
	'flex' : 'ъ	о	огѡ/а	ого/а	ому/у	омъ/2ѣмъ	2ѣмъ	а	у	оя	ой/ѣ	ою	2ы/2и	и	а^	2ѣхъ	2ѣмъ^	2ѣми	а^	2ѣ^	ѡю	2ѣма	ій	ое	агѡ	аго	-	имъ	ая	ую	ія	2ѣй/ой	2ыи/2іи	ія/ія^	ая^	ихъ	имъ^	ими	ая^	2ѣи	ѡю	има'
	},
#___________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'PA2t' : {
	'type' : 'PA2',
	'core' : r'(.*)()()(ой)',
	'inflex' : '',
	'flex' : 'ой	ое/о	огѡ	ого	ому	омъ	ѣмъ	ая/а	у/ую	оя	ой	ою	іи/и	ыя/ы^	ая^/а^	ѣхъ	ѣмъ^	ѣми	а^	ѣ^/а^	ѡю	ѣма'
	},
'PA2j' : {
	'type' : 'PA2',
	'core' : r'(.*)()()(ей)',
	'inflex' : '',
	'flex' : 'ей	іе	егѡ	его	ему	емъ	имъ	ія	ію	ея	ей	ею	іи	ія^	ія	ихъ	имъ^	ими	ія^	ія^	ею^	има'
	},
'PA2j*' : {
	'type' : 'PA2',
	'core' : r'(.*)(е)(с)(ь)',
	'inflex' : 'е|',
	'flex' : '2ь	е	егѡ	его	ему	емъ	имъ	я	ю	ея	ей	ею	и	я^	я^	ѣхъ	ѣмъ^	ѣми	я^	ѣ^/я^	ею^	ѣма'
	},
'PA2k' : {
	'type' : 'PA2',
	'core' : r'(.*)()()(ій)',
	'inflex' : '',
	'flex' : 'ій	ое	оегѡ	оего	оему	оемъ	іимъ/имъ	ая	ую	оея	оей	оею	іи	ія^	ая^	іихъ/ихъ	іимъ^/имъ^	іими/ими	ая^	іи	оею^	іима/има'
	},
'PA2s' : {
	'type' : 'PA2',
	'core' : r'(.*)()()(ъ)',
	'inflex' : '',
	'flex' : 'ъ	е	егѡ	его	ему	емъ	имъ	а	у	ея	ей	ею	и	я/ы	а	ихъ	имъ^/ымъ	ими	а^	и	ею^	има'
	},
'PA2a' : {
	'type' : 'PA2',
	'core' : r'(.*)()()(й)',
	'inflex' : '',
	'flex' : 'й	е	егѡ	его	ему	емъ	имъ	я	ю	ея	ей	ею	и	я^	я^	ихъ	имъ^	ими	я^	и	ею^	има'
	},
#________________________________________________________________________________________________________________________________________________________________________________________________________________________
'PA2i' : {
	'type' : 'PA2i',
	'core' : r'(.*)()()(и)',
	'inflex' : '',
	'flex' : '#и	е/не	егѡ/негѡ	его/и/нь	ему/нему	емъ/немъ	имъ/нимъ	#я	ю/ню	ея/нея	ей/ней	ею/нею	#е	я/ня/ихъ/нихъ	я/ня	ихъ/нихъ	имъ/нимъ	ими/ними	-	я/ня	ею/нею	има/нима'
	},
#________________________________________________________________________________________________________________________________________________________________________________________________________________________
'PNja' : {
	'type' : 'PN',
	'core' : r'(.*)()()(азъ)',
	'inflex' : '',
	'flex' : 'азъ	менє	мене	мнѣ	мнѣ	мною	мя	ми	-	-	-	-'
	},
'PNty' : {
	'type' : 'PN',
	'core' : r'(.*)()(т)(ы)',
	'inflex' : '',
	'flex' : 'ы	ебє	ебе	ебѣ	ебѣ	обою	я	и	-	-	-	-'
	},
'PNseb' : {
	'type' : 'PN',
	'core' : r'(.*)()(с)(#ы)',
	'inflex' : '',
	'flex' : '#ы	ебє	ебе	ебѣ	ебѣ	обою	я	и	-	-	-	-'
	},
'PNmy' : {
	'type' : 'PN',
	'core' : r'(.*)()()(мы)',
	'inflex' : '',
	'flex' : 'мы	насъ	насъ	намъ	насъ	нами	ны	-	мы	ны	наю	нама'
	},
'PNvy' : {
	'type' : 'PN',
	'core' : r'(.*)()(в)(ы)',
	'inflex' : '',
	'flex' : 'ы	асъ	асъ	амъ	асъ	ами	ы	-	ы	ы	аю	ама'
	},
'PNcto' : {
	'type' : 'PN',
	'core' : r'(.*)()(ч)(то)',
	'inflex' : '',
	'flex' : 'то	егѡ/есѡ/есогѡ/есо	то	ему/есому	емъ/есомъ	имъ'
	},
#____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'NUM2' : {
	'type' : 'NUM2',
	'core' : r'(.*)()(дв)(а)',
	'inflex' : '',
	'flex' : 'а	ѣ	ою/у	ѣма'
	},
'NUMoba' : {
	'type' : 'NUM2',
	'core' : r'(.*)()(об)(а)',
	'inflex' : '',
	'flex' : 'а	ѣ	ою	ѣма'
	},
#____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'NUM3' : {
	'type' : 'NUM3',
	'core' : r'(.*)()(тр)(и)',
	'inflex' : '',
	'flex' : 'и/іе	ехъ	емъ	еми'
	},
'NUM4' : {
	'type' : 'NUM3',
	'core' : r'(.*)()(четыр)(е)',
	'inflex' : '',
	'flex' : 'е/и	ехъ	емъ	ьми'
	},
#____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'#N41' : {
	'type' : '#NUM',
	'core' : r'(.*)()()(ь)',
	'inflex' : '',
	'flex' : '=N41,sg'
	},
'N10' : {
	'type' : '#NUM',
	'core' : r'(.*)()()(ь)',
	'inflex' : '',
	'flex' : 'ь|е	и	и	и	ію	и/е	ъ/ихъ	ехъ/ихъ	емъ/имъ	ьми	и/ѣ	y	ьма'
	},
'#NUM100' : {
	'type' : '#NUM',
	'core' : r'(.*)()()(ь)',
	'inflex' : '',
	'flex' : 'о	а	у	ѣ	омъ	а^	ъ^	ѣхъ	ѡмъ	ы	ѣ^	y^	ома'
	},
#____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'NUMoe' : {
	'type' : 'NUMoe',
	'core' : r'(.*)()()(е)',
	'inflex' : '',
	'flex' : 'е	ихъ	имъ	ими	и	я'
	},
'NUMero' : {
	'type' : 'NUMoe',
	'core' : r'(.*)()()(ы)',
	'inflex' : '',
	'flex' : 'ы	ыхъ	ымъ	ыми	ы	ы'
	},
#____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'$A0' : {
	'type' : '$A0',
	'core' : r'(.*)()()(ъ)',
	'inflex' : '',
	'flex' : 'ъ	а	о	и	а^	и'
	},
'$A0' : {
	'type' : '$A0',
	'core' : r'(.*)(е)(л)(ъ)',
	'inflex' : '|е',
	'flex' : '2ъ	а	о	и	а^	и'
	},
#____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'$V0' : {
	'type' : '$V0',
	'core' : r'(.*)()()()',
	'inflex' : '',
	'flex' : 'а	ѣ'
	},
#____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
'V21n' : {
	'type' : 'V',
	'core' : r'(.*)()()(ити)',
	'inflex' : '',
	'flex' : 'ити	ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/ь+$A1sh/+$A1sh	им+$A1t	ен+$A1n*'
	},
'V21a' : {
	'type' : 'V',
	'core' : r'(.*)()()(ити)',
	'inflex' : '',
	'flex' : 'ити	ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	й	йте	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh	им+$A1t	ен+$A1n*'
	},
'V21s' : {
	'type' : 'V',
	'core' : r'(.*)()()(ити)',
	'inflex' : '',
	'flex' : 'ити	у	иши	итъ	имъ	ите	атъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	а/ай/я/яй	ащ+$A1sx	ив+$A1sh/#+$A1sh	им+$A1t	ен+$A1n*'
	},
'V21pl' : {
	'type' : 'V',
	'core' : r'(.*)(п)()(ити)',
	'inflex' : 'п|пл',
	'flex' : 'ити	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2яхъ/яхъ	2яше/яше	2яхомъ/яхомъ	2ясте/ясте	2яху/яху	2яхов+$V0/яхов+$V0	2яст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21bl' : {
	'type' : 'V',
	'core' : r'(.*)(б)()(ити)',
	'inflex' : 'б|бл',
	'flex' : 'ити	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2яхъ/яхъ	2яше/яше	2яхомъ/яхомъ	2ясте/ясте	2яху/яху	2яхов+$V0/яхов+$V0	2яст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21vl' : {
	'type' : 'V',
	'core' : r'(.*)(в)()(ити)',
	'inflex' : 'в|вл',
	'flex' : 'ити	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2яхъ/яхъ	2яше/яше	2яхомъ/яхомъ	2ясте/ясте	2яху/яху	2яхов+$V0/яхов+$V0	2яст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21ml' : {
	'type' : 'V',
	'core' : r'(.*)(м)()(ити)',
	'inflex' : 'м|мл',
	'flex' : 'ити	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2яхъ/яхъ	2яше/яше	2яхомъ/яхомъ	2ясте/ясте	2яху/яху	2яхов+$V0/яхов+$V0	2яст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21tvl' : {
	'type' : 'V',
	'core' : r'(.*)(тв)()(ити)',
	'inflex' : 'тв|щвл',
	'flex' : 'ити	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2яхъ/яхъ	2яше/яше	2яхомъ/яхомъ	2ясте/ясте	2яху/яху	2яхов+$V0/яхов+$V0	2яст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21sl' : {
	'type' : 'V',
	'core' : r'(.*)(сл)()(ити)',
	'inflex' : 'сл|шл',
	'flex' : 'ити	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2яхъ/яхъ	2яше/яше	2яхомъ/яхомъ	2ясте/ясте	2яху/яху	2яхов+$V0/яхов+$V0	2яст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21dzhd' : {
	'type' : 'V',
	'core' : r'(.*)(д)()(ити)',
	'inflex' : 'д|жд',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21dzh' : {
	'type' : 'V',
	'core' : r'(.*)(д)()(ити)',
	'inflex' : 'д|ж',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21tsch' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ити)',
	'inflex' : 'т|щ',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21tch' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ити)',
	'inflex' : 'т|ч',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21ssh' : {
	'type' : 'V',
	'core' : r'(.*)(с)()(ити)',
	'inflex' : 'с|ш',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21zzh' : {
	'type' : 'V',
	'core' : r'(.*)(з)()(ити)',
	'inflex' : 'з|ж',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21stsch' : {
	'type' : 'V',
	'core' : r'(.*)(ст)()(ити)',
	'inflex' : 'ст|щ',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V21zdzhd' : {
	'type' : 'V',
	'core' : r'(.*)(зд)()(ити)',
	'inflex' : 'зд|жд',
	'flex' : 'ити	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	2ахъ/яхъ	2аше/яше	2ахомъ/яхомъ	2асте/ясте	2аху/яху	2ахов+$V0/яхов+$V0	2аст+$V0/яст+$V0	ихъ	и	ихомъ	исте	иша	ихов+$V0	ист+$V0	ил+$A0	-	я/яй	ящ+$A1sx	ив+$A1sh/2ь+$A1sh/2+$A1sh	им+$A1t	2ен+$A1n*'
	},
'V22n' : {
	'type' : 'V',
	'core' : r'(.*)()()(ѣти)',
	'inflex' : '',
	'flex' : 'ѣти	ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	ен+$A1n*/ѣн+$A1n*'
	},
'V22p' : {
	'type' : 'V',
	'core' : r'(.*)(п)()(ѣти)',
	'inflex' : 'п|пл',
	'flex' : 'ѣти	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	ѣн+$A1n*'
	},
'V22b' : {
	'type' : 'V',
	'core' : r'(.*)(б)()(ѣти)',
	'inflex' : 'б|бл',
	'flex' : 'ѣти	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	ѣн+$A1n*'
	},
'V22m' : {
	'type' : 'V',
	'core' : r'(.*)(м)()(ѣти)',
	'inflex' : 'м|мл',
	'flex' : 'ѣти	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	ѣн+$A1n*'
	},
'V22dzhd' : {
	'type' : 'V',
	'core' : r'(.*)(д)()(ѣти)',
	'inflex' : 'д|жд',
	'flex' : 'ѣти	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	2ен+$A1n*/ѣн+$A1n*'
	},
'V22tsch' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ѣти)',
	'inflex' : 'т|щ',
	'flex' : 'ѣти	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	2ен+$A1n*/ѣн+$A1n*'
	},
'V22tch' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ѣти)',
	'inflex' : 'т|ч',
	'flex' : 'ѣти	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	2ен+$A1n*/ѣн+$A1n*'
	},
'V22ssh' : {
	'type' : 'V',
	'core' : r'(.*)(с)()(ѣти)',
	'inflex' : 'с|ш',
	'flex' : 'ѣти	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	2ен+$A1n*/ѣн+$A1n*'
	},
'V22stsch' : {
	'type' : 'V',
	'core' : r'(.*)(ст)()(ѣти)',
	'inflex' : 'ст|щ',
	'flex' : 'ѣти	2у	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	им+$A1t	2ен+$A1n*/ѣн+$A1n*'
	},
'V22s' : {
	'type' : 'V',
	'core' : r'(.*)()(ш|ж|ч|щ)(ати)',
	'inflex' : '',
	'flex' : 'ати	у	иши	итъ	имъ	ите	атъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	а/ай/я/яй	ащ+$A1sx	ав+$A1sh	им+$A1t	ан+$A1n*'
	},
'V22a' : {
	'type' : 'V',
	'core' : r'(.*)()()(яти)',
	'inflex' : '',
	'flex' : 'яти	ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	й	йте	имъ	ив+$V0	йт+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	яхъ	я	яхомъ	ясте	яша	яхов+$V0	яст+$V0	ял+$A0	-	я/яй	ящ+$A1sx	яв+$A1sh	им+$A1t	ян+$A1n*'
	},
'V11a' : {
	'type' : 'V',
	'core' : r'(.*)()()(ти)',
	'inflex' : '',
	'flex' : 'ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	й	йте	имъ/емъ	ив+$V0/ев+$V0	йт+$V0	хъ	ше	хомъ	сте	ху	хов+$V0	ст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	я/яй	ющ+$A1sx	в+$A1sh	ем+$A1t	н+$A1n*'
	},
'V11e' : {
	'type' : 'V',
	'core' : r'(.*)(ѣ)()(ти)',
	'inflex' : 'ѣ|',
	'flex' : 'ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	й	йте	имъ/емъ	ив+$V0/ев+$V0	йт+$V0	2яхъ/яхъ	2яше/яше	2яхомъ/яхомъ	2ясте/ясте	2яху/яху	яхов+$V0/2яхов+$V0	яст+$V0/2яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	я/яй	ющ+$A1sx	в+$A1sh	ем+$A1t	н+$A1n*'
	},
'V12ovau' : {
	'type' : 'V',
	'core' : r'(.*)(ова)()(ти)',
	'inflex' : 'ова|у',
	'flex' : 'ти	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2й	2йте	2имъ/2емъ	2ив+$V0/2ев+$V0	2йт+$V0	хъ	ше	хомъ	сте	ху	хов+$V0	ст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2я/2яй	2ющ+$A1sx	1в+$A1sh	2ем+$A1t	1н+$A1n*'
	},
'V12evau' : {
	'type' : 'V',
	'core' : r'(.*)(ева)()(ти)',
	'inflex' : 'ева|у',
	'flex' : 'ти	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2й	2йте	2имъ/2емъ	2ив+$V0/2ев+$V0	2йт+$V0	хъ	ше	хомъ	сте	ху	хов+$V0	ст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2я/2яй	2ющ+$A1sx	1в+$A1sh	2ем+$A1t	1н+$A1n*'
	},
'V12evaju' : {
	'type' : 'V',
	'core' : r'(.*)(ева)()(ти)',
	'inflex' : 'ева|ю',
	'flex' : 'ти	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2й	2йте	2имъ/2емъ	2ив+$V0/2ев+$V0	2йт+$V0	хъ	ше	хомъ	сте	ху	хов+$V0	ст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2я/2яй	2ющ+$A1sx	1в+$A1sh	2ем+$A1t	1н+$A1n*'
	},
'V12n' : {
	'type' : 'V',
	'core' : r'(.*)()(л|н|р)(ати)',
	'inflex' : '',
	'flex' : 'ати	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	ахъ/яхъ	аше/яше	ахомъ/яхомъ	асте/ясте	аху/яху	ахов+$V0/яхов+$V0	аст+$V0/яст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	я/яй	ющ+$A1sx	ав+$A1sh	ем+$A1t	ан+$A1n*'
	},
'V12p' : {
	'type' : 'V',
	'core' : r'(.*)(п)()(ати)',
	'inflex' : 'п|пл',
	'flex' : 'ати	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ/2яхъ	аше/2яше	ахомъ/2яхомъ	асте/2ясте	аху/2яху	ахов+$V0/2яхов+$V0	аст+$V0/2яст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2я/2яй	2ющ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12b' : {
	'type' : 'V',
	'core' : r'(.*)(б)()(ати)',
	'inflex' : 'б|бл',
	'flex' : 'ати	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ/2яхъ	аше/2яше	ахомъ/2яхомъ	асте/2ясте	аху/2яху	ахов+$V0/2яхов+$V0	аст+$V0/2яст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2я/2яй	2ющ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12m' : {
	'type' : 'V',
	'core' : r'(.*)(м)()(ати)',
	'inflex' : 'м|мл',
	'flex' : 'ати	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ/2яхъ	аше/2яше	ахомъ/2яхомъ	асте/2ясте	аху/2яху	ахов+$V0/2яхов+$V0	аст+$V0/2яст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2я/2яй	2ющ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12i' : {
	'type' : 'V',
	'core' : r'(.*)(им)()(ати)',
	'inflex' : 'им|емл',
	'flex' : 'ати	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ/2яхъ	аше/2яше	ахомъ/2яхомъ	асте/2ясте	аху/2яху	ахов+$V0/2яхов+$V0	аст+$V0/2яст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2я/2яй	2ющ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12y' : {
	'type' : 'V',
	'core' : r'(.*)(ым)()(ати)',
	'inflex' : 'ым|ъемл',
	'flex' : 'ати	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ/2яхъ	аше/2яше	ахомъ/2яхомъ	асте/2ясте	аху/2яху	ахов+$V0/2яхов+$V0	аст+$V0/2яст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2я/2яй	2ющ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12v' : {
	'type' : 'V',
	'core' : r'(.*)(в)()(ати)',
	'inflex' : 'в|',
	'flex' : 'ати	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2й	2йте	2имъ/2емъ	2ив+$V0/2ев+$V0	2йт+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2я/2яй	2ющ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12dzhd' : {
	'type' : 'V',
	'core' : r'(.*)(д)()(ати)',
	'inflex' : 'д|жд',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12tsch' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ати)',
	'inflex' : 'т|щ',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12tch' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ати)',
	'inflex' : 'т|ч',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12stsch' : {
	'type' : 'V',
	'core' : r'(.*)(ст)()(ати)',
	'inflex' : 'ст|щ',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12ssh' : {
	'type' : 'V',
	'core' : r'(.*)(с)()(ати)',
	'inflex' : 'с|ш',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12zzh' : {
	'type' : 'V',
	'core' : r'(.*)(з)()(ати)',
	'inflex' : 'з|ж',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12kch' : {
	'type' : 'V',
	'core' : r'(.*)(к)()(ати)',
	'inflex' : 'к|ч',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12sksch' : {
	'type' : 'V',
	'core' : r'(.*)(ск)()(ати)',
	'inflex' : 'ск|щ',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12gzh' : {
	'type' : 'V',
	'core' : r'(.*)(г)()(ати)',
	'inflex' : 'г|ж',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12hsh' : {
	'type' : 'V',
	'core' : r'(.*)(х)()(ати)',
	'inflex' : 'х|ш',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12cch' : {
	'type' : 'V',
	'core' : r'(.*)(ц)()(ати)',
	'inflex' : 'ц|ч',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12dizhd' : {
	'type' : 'V',
	'core' : r'(.*)(д)()(ати)',
	'inflex' : 'д|ижд',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12zdzhd' : {
	'type' : 'V',
	'core' : r'(.*)(зд)()(ати)',
	'inflex' : 'зд|жд',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2а/2ай/2я/2яй	2ущ+$A1sx	ав+$A1sh	2ем+$A1t	ан+$A1n*'
	},
'V12a' : {
	'type' : 'V',
	'core' : r'(.*)()()(яти)',
	'inflex' : '',
	'flex' : 'яти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	й	йте	имъ	ив+$V0	йт+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	яхъ	я	яхомъ	ясте	яша	яхов+$V0	яст+$V0	ял+$A0	-	я/яй	ющ+$A1sx	яв+$A1sh	ем+$A1t	ян+$A1n*'
	},
'V12x' : {
	'type' : 'V',
	'core' : r'(.*)()()(ати)',
	'inflex' : '',
	'flex' : 'ати	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	ый	ущ+$A1sx	ав+$A1sh	-	ан+$A1n*'
	},
'V12x*-a' : {
	'type' : 'V',
	'core' : r'(.*)()(р)(ати)',
	'inflex' : '|е',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2емъ/2имъ	2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2ый	2ущ+$A1sx	ав+$A1sh	2ом+$A1t	ан+$A1n*'
	},
'V12x*-b' : {
	'type' : 'V',
	'core' : r'(.*)(об)(р)(ати)',
	'inflex' : 'об|бе',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2емъ/2имъ	2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2ый	2ущ+$A1sx	ав+$A1sh	2ом+$A1t	ан+$A1n*'
	},
'V12x*-c' : {
	'type' : 'V',
	'core' : r'(.*)()(в)(ати)',
	'inflex' : '|о',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2емъ/2имъ	2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2ый	2ущ+$A1sx	ав+$A1sh	2ом+$A1t	ан+$A1n*'
	},
'V12x*-d' : {
	'type' : 'V',
	'core' : r'(.*)(оз)(в)(ати)',
	'inflex' : 'оз|зо',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2емъ/2имъ	2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2ый	2ущ+$A1sx	ав+$A1sh	2ом+$A1t	ан+$A1n*'
	},
'V12x*-e' : {
	'type' : 'V',
	'core' : r'(.*)(г)(н)(ати)',
	'inflex' : 'г|же',
	'flex' : 'ати	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2емъ/2имъ	2ев+$V0	2ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	2ый	2ущ+$A1sx	ав+$A1sh	2ом+$A1t	ан+$A1n*'
	},
'V13a' : {
	'type' : 'V',
	'core' : r'(.*)()()(ути)',
	'inflex' : '',
	'flex' : 'ути	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ/имъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ухъ	у/е	ухомъ	усте	уша	ухов+$V0	уст+$V0	ул+$A0	-	ый	ущ+$A1sx	ув+$A1sh	-	овен+$A1n*/ут+$A1t'
	},
'V13t' : {
	'type' : 'V',
	'core' : r'(.*)()()(нути)',
	'inflex' : '',
	'flex' : 'нути	ну	неши	нетъ	немъ	нете	нутъ	нев+$V0	нет+$V0	ни	ните	немъ/нимъ	нев+$V0	нит+$V0	няхъ	няше	няхомъ	нясте	няху	няхов+$V0	няст+$V0	нухъ/охъ	ну/е	нухомъ/охомъ	нусте/осте	нуша/оша	нухов+$V0/охов+$V0	нуст+$V0/ост+$V0	л+$A0/нул+$A0	-	ный	нущ+$A1sx	#+$A1sh/нув+$A1sh	-	новен+$A1n*/нут+$A1t'
	},
'V13g' : {
	'type' : 'V',
	'core' : r'(.*)(г)()(нути)',
	'inflex' : 'г|ж',
	'flex' : 'нути	ну	неши	нетъ	немъ	нете	нутъ	нев+$V0	нет+$V0	ни	ните	немъ/нимъ	нев+$V0	нит+$V0	няхъ	няше	няхомъ	нясте	няху	няхов+$V0	няст+$V0	нухъ/охъ	ну/2е	нухомъ/охомъ	нусте/осте	нуша/оша	нухов+$V0/охов+$V0	нуст+$V0/ост+$V0	л+$A0/нул+$A0	-	ный	нущ+$A1sx	#+$A1sh/нув+$A1sh	-	нут+$A1t/2ен+$A1n*/нен+$A1n*'
	},
'V13k' : {
	'type' : 'V',
	'core' : r'(.*)(к)()(нути)',
	'inflex' : 'к|ч',
	'flex' : 'нути	ну	неши	нетъ	немъ	нете	нутъ	нев+$V0	нет+$V0	ни	ните	немъ/нимъ	нев+$V0	нит+$V0	няхъ	няше	няхомъ	нясте	няху	няхов+$V0	няст+$V0	нухъ/охъ	ну/2е	нухомъ/охомъ	нусте/осте	нуша/оша	нухов+$V0/охов+$V0	нуст+$V0/ост+$V0	л+$A0/нул+$A0	-	ный	нущ+$A1sx	#+$A1sh/нув+$A1sh	-	нут+$A1t/2ен+$A1n*/нен+$A1n*'
	},
'V13h' : {
	'type' : 'V',
	'core' : r'(.*)(х)()(нути)',
	'inflex' : 'х|ш',
	'flex' : 'нути	ну	неши	нетъ	немъ	нете	нутъ	нев+$V0	нет+$V0	ни	ните	немъ/нимъ	нев+$V0	нит+$V0	няхъ	няше	няхомъ	нясте	няху	няхов+$V0	няст+$V0	нухъ/охъ	ну/2е	нухомъ/охомъ	нусте/осте	нуша/оша	нухов+$V0/охов+$V0	нуст+$V0/ост+$V0	л+$A0/нул+$A0	-	ный	нущ+$A1sx	#+$A1sh/нув+$A1sh	-	нут+$A1t/2ен+$A1n*/нен+$A1n*'
	},
'V14z' : {
	'type' : 'V',
	'core' : r'(.*)()()(ти)',
	'inflex' : '',
	'flex' : 'ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	л+$A0	-	ый/я/яй	ущ+$A1sx	#+$A1sh	ом+$A1t	ен+$A1n*'
	},
'V14t' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(сти)',
	'inflex' : 'т|',
	'flex' : '2сти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0	-	ый/я/яй	ущ+$A1sx	#+$A1sh	ом+$A1t	ен+$A1n*'
	},
'V14d' : {
	'type' : 'V',
	'core' : r'(.*)(д)()(сти)',
	'inflex' : 'д|',
	'flex' : '2сти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0	-	ый/я/яй	ущ+$A1sx	#+$A1sh	ом+$A1t	ен+$A1n*'
	},
'V14p' : {
	'type' : 'V',
	'core' : r'(.*)()()(сти)',
	'inflex' : '',
	'flex' : 'сти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	л+$A0	-	ый/я/яй	ущ+$A1sx	#+$A1sh	ом+$A1t	ен+$A1n*'
	},
'V14st' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ти)',
	'inflex' : 'т|',
	'flex' : '2ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0	-	ый	ущ+$A1sx	#+$A1sh	-	-'
	},
'V14t*-a' : {
	'type' : 'V',
	'core' : r'(.*)(е)()(сти)',
	'inflex' : 'т||е|ет',
	'flex' : '3сти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0*	3л+ъ	ый/я/яй	ущ+$A1sx	4+$A1sh	ом+$A1t	ен+$A1n*'
	},
'V14t*-b' : {
	'type' : 'V',
	'core' : r'(.*)(че)()(сти)',
	'inflex' : 'очт|оч|че|чет',
	'flex' : '3сти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0*	3л+ъ	ый/я/яй	ущ+$A1sx	4+$A1sh	ом+$A1t	ен+$A1n*'
	},
'V14ed' : {
	'type' : 'V',
	'core' : r'(.*)(ѣ)()(сти)',
	'inflex' : 'яд|ѣд|ѣ',
	'flex' : '3сти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	-	-	-	-	-	-	-	2охъ	2е	2охомъ	2осте	2оша	2охов+$V0	2ост+$V0	3л+$A0	-	-	-	2+$A1sh	-	2ен+$A1n*'
	},
'V14et' : {
	'type' : 'V',
	'core' : r'(.*)(ѣ)()(сти)',
	'inflex' : 'ящ|ѣт|ѣ',
	'flex' : '3сти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	-	-	-	-	-	-	-	2охъ	2е	2охомъ	2осте	2оша	2охов+$V0	2ост+$V0	3л+$A0	-	-	-	2+$A1sh	-	2ен+$A1n*'
	},
'V14k' : {
	'type' : 'V',
	'core' : r'(.*)()()(щи)',
	'inflex' : 'к|ч|ц|',
	'flex' : '4щи	у	2еши	2етъ	2емъ	2ете	утъ	2ев+$V0	2ет+$V0	3ы	3ыте	3емъ	3ев+$V0	3ыт+$V0	2ахъ	2аше	2ахомъ	2асте	2аху	2ахов+$V0	2аст+$V0	охъ	2е	охомъ	осте	оша	охов+$V0	ост+$V0	л+$A0	-	ій/2а/2я	ущ+$A1sx	#+$A1sh	ом+$A1t	2ен+$A1n*'
	},
'V14g' : {
	'type' : 'V',
	'core' : r'(.*)()()(щи)',
	'inflex' : 'г|ж|з|',
	'flex' : '4щи	у	2еши	2етъ	2емъ	2ете	утъ	2ев+$V0	2ет+$V0	3и	3ите	3емъ	3ев+$V0	3ит+$V0	2ахъ	2аше	2ахомъ	2асте	2аху	2ахов+$V0	2аст+$V0	охъ	2е	охомъ	осте	оша	охов+$V0	ост+$V0	л+$A0	-	ій/2а/2я	ущ+$A1sx	#+$A1sh	ом+$A1t	2ен+$A1n*'
	},
'V14g*-a' : {
	'type' : 'V',
	'core' : r'(.*)(е)()(щи)',
	'inflex' : 'г|ж|з|ег|е',
	'flex' : '5щи	у	2еши	2етъ	2емъ	2ете	утъ	2ев+$V0	2ет+$V0	3и	3ите	3емъ	3ев+$V0	3ит+$V0	2ахъ	2аше	2ахомъ	2асте	2аху	2ахов+$V0	2аст+$V0	охъ	2е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0*	4л+ъ	ій	ущ+$A1sx	4+$A1sh	ом+$A1t	2ен+$A1n*'
	},
'V14g*-b' : {
	'type' : 'V',
	'core' : r'(.*)(ре)()(щи)',
	'inflex' : 'ерг|ерж|ерз|ерг|ре',
	'flex' : '5щи	у	2еши	2етъ	2емъ	2ете	утъ	2ев+$V0	2ет+$V0	3и	3ите	3емъ	3ев+$V0	3ит+$V0	2ахъ	2аше	2ахомъ	2асте	2аху	2ахов+$V0	2аст+$V0	охъ	2е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0*	4л+ъ	ій	ущ+$A1sx	4+$A1sh	ом+$A1t	2ен+$A1n*'
	},
'V14eg' : {
	'type' : 'V',
	'core' : r'(.*)(е)()(щи)',
	'inflex' : 'яг|яж|яз|ег|еж|е',
	'flex' : '6щи	у	2еши	2етъ	2емъ	2ете	утъ	2ев+$V0	2ет+$V0	3и	3ите	3емъ	3ев+$V0	3ит+$V0	-	-	-	-	-	-	-	4охъ/охъ	5е/2е	4охомъ/охомъ	4осте/осте	4оша/оша	4охов+$V0/охов+$V0	4ост+$V0/ост+$V0	4л+$A0	-	-	-	4+$A1sh	-	-'
	},
'V15re' : {
	'type' : 'V',
	'core' : r'(.*)(ре)()(ти)',
	'inflex' : 'р|ер|ре',
	'flex' : '3ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0	-	ый/я/яй	ущ+$A1sx	2+$A1sh	ом+$A1t	2т+$A1t/ен+$A1n*'
	},
'V15er' : {
	'type' : 'V',
	'core' : r'(.*)(ер)()(ти)',
	'inflex' : 'р|ер|ер',
	'flex' : '3ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0	-	ый/я/яй	ущ+$A1sx	2+$A1sh	ом+$A1t	2т+$A1t/ен+$A1n*'
	},
'V15ol' : {
	'type' : 'V',
	'core' : r'(.*)(ла)()(ти)',
	'inflex' : 'ол|ла',
	'flex' : '2ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	2хъ	2	2хомъ	2сте	2ша	2хов+$V0	2ст+$V0	2л+$A0	-	я/яй	ющ+$A1sx	2в+$A1sh	ем+$A1t/им+$A1t	ен+$A1t/2н+$A1n*'
	},
'V15or' : {
	'type' : 'V',
	'core' : r'(.*)(ра)()(ти)',
	'inflex' : 'ор|ра',
	'flex' : '2ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	2хъ	2	2хомъ	2сте	2ша	2хов+$V0	2ст+$V0	2л+$A0	-	я/яй	ющ+$A1sx	2в+$A1sh	ем+$A1t/им+$A1t	ен+$A1t/2н+$A1n*'
	},
'V15el' : {
	'type' : 'V',
	'core' : r'(.*)(ле)()(ти)',
	'inflex' : 'ел|ле',
	'flex' : '2ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	и	ите	емъ	ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0	-	я/яй	ющ+$A1sx	2в+$A1sh	-	ен+$A1t'
	},
'V15i' : {
	'type' : 'V',
	'core' : r'(.*)(и)()(ти)',
	'inflex' : 'и|i',
	'flex' : 'ти	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2й	2йте	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2я/2яй	2ющ+$A1sx	в+$A1sh	2ем+$A1t	т+$A1t/2ен+$A1n*'
	},
'V15y' : {
	'type' : 'V',
	'core' : r'(.*)(ы)()(ти)',
	'inflex' : 'ы|ов',
	'flex' : 'ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	й	йте	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	я/яй	ющ+$A1sx	в+$A1sh	ем+$A1t	т+$A1t/2ен+$A1n*'
	},
'V15u' : {
	'type' : 'V',
	'core' : r'(.*)(у)()(ти)',
	'inflex' : 'у|ув',
	'flex' : 'ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	й	йте	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	я/яй	ющ+$A1sx	в+$A1sh	ем+$A1t	т+$A1t/2ен+$A1n*'
	},
'V15e' : {
	'type' : 'V',
	'core' : r'(.*)(ѣ)()(ти)',
	'inflex' : 'ѣ|о',
	'flex' : 'ти	2ю	2еши	2етъ	2емъ	2ете	2ютъ	2ев+$V0	2ет+$V0	2й	2йте	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2я/2яй	2ющ+$A1sx	в+$A1sh	2ем+$A1t	т+$A1t'
	},
'V15im' : {
	'type' : 'V',
	'core' : r'(.*)(я)()(ти)',
	'inflex' : 'я|им|ем',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15ym' : {
	'type' : 'V',
	'core' : r'(.*)(ъя)()(ти)',
	'inflex' : 'ъя|ым|ъем',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15ozjm' : {
	'type' : 'V',
	'core' : r'(.*)(зя)()(ти)',
	'inflex' : 'зя|озьм|зем',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15onm' : {
	'type' : 'V',
	'core' : r'(.*)(ня)()(ти)',
	'inflex' : 'ня|онм|нем',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15jm' : {
	'type' : 'V',
	'core' : r'(.*)(я)()(ти)',
	'inflex' : 'я|йм|ем',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15n' : {
	'type' : 'V',
	'core' : r'(.*)(я)()(ти)',
	'inflex' : 'я|н|ен',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15in' : {
	'type' : 'V',
	'core' : r'(.*)(а)()(ти)',
	'inflex' : 'а|н|ен',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15im' : {
	'type' : 'V',
	'core' : r'(.*)(а)()(ти)',
	'inflex' : 'а|м|ем',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15en' : {
	'type' : 'V',
	'core' : r'(.*)(я)()(ти)',
	'inflex' : 'я|ен|ен',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15um' : {
	'type' : 'V',
	'core' : r'(.*)(у)()(ти)',
	'inflex' : 'у|м|ум',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/тъ	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	3+$A1sh/в+$A1sh	-	т+$A1t'
	},
'V15a' : {
	'type' : 'V',
	'core' : r'(.*)()()(ти)',
	'inflex' : '',
	'flex' : 'ти	ну	неши	нетъ	немъ	нете	нутъ	нев+$V0	нет+$V0	ни	ните	нимъ/немъ	нив+$V0/нев+$V0	нит+$V0	хъ	ше	хомъ	сте	ху	хов+$V0	ст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	ный	нущ+$A1sx	в+$A1sh	-	т+$A1t'
	},
'V15ieiezh' : {
	'type' : 'V',
	'core' : r'(.*)(ѣ|ѣж)()(ти)',
	'inflex' : '',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	в+$A1sh	-	т+$A1t'
	},
'V15ieezhd' : {
	'type' : 'V',
	'core' : r'(.*)(ѣ)()(ти)',
	'inflex' : 'ѣ|ѣжд',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	в+$A1sh	-	т+$A1t'
	},
'V15v' : {
	'type' : 'V',
	'core' : r'(.*)()()(ти)',
	'inflex' : '|в',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/2е	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	в+$A1sh	-	т+$A1t/2ен+$A1n*'
	},
'V15yov' : {
	'type' : 'V',
	'core' : r'(.*)(ы)()(ти)',
	'inflex' : 'ы|ов',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/2е	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	в+$A1sh	-	т+$A1t/2ен+$A1n*'
	},
'V15uov' : {
	'type' : 'V',
	'core' : r'(.*)()()(ти)',
	'inflex' : '',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#/2е	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	в+$A1sh	-	т+$A1t/2ен+$A1n*'
	},
'V12p+V22p' : {
	'type' : 'V',
	'core' : r'(.*)(п)()(ати)',
	'inflex' : 'п|пл',
	'flex' : 'ати	2ю	иши	итъ	имъ	ите	ятъ	ив+$V0	ит+$V0	и	ите	имъ	ив+$V0	ит+$V0	ахъ	аше	ахомъ	асте	аху	ахов+$V0	аст+$V0	ахъ	а	ахомъ	асте	аша	ахов+$V0	аст+$V0	ал+$A0	-	я/яй	ящ+$A1sx	ав+$A1sh	-	ан+$A1n*'
	},
'V22t+V12t' : {
	'type' : 'V',
	'core' : r'(.*)(т)()(ѣти)',
	'inflex' : 'т|щ',
	'flex' : 'ѣти	2у	2еши	2етъ	2емъ	2ете	ятъ/2утъ	2ев+$V0	2ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	-	2ен+$A1n*'
	},
'V22+V14' : {
	'type' : 'V',
	'core' : r'(.*)()(в)(ѣти)',
	'inflex' : '',
	'flex' : 'ѣти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	я/яй	ящ+$A1sx	ѣв+$A1sh	-	ен+$A1n*'
	},
'Viti' : {
	'type' : 'V',
	'core' : r'(.*)(и)()(ти)',
	'inflex' : 'ид|и|ш|ше|шед',
	'flex' : '2ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	3л+$A0*	4л+ъ	ый/я/яй	ущ+$A1sx	5+$A1sh	-	ен+$A1n*'
	},
'Vnaiti' : {
	'type' : 'V',
	'core' : r'(.*)(й)()(ти)',
	'inflex' : 'йд|й|ш|ше|шед',
	'flex' : '2ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	3л+$A0*	4л+ъ	ый/я/яй	ущ+$A1sx	5+$A1sh	-	ен+$A1n*'
	},
'Vzyti' : {
	'type' : 'V',
	'core' : r'(.*)(зы)()(ти)',
	'inflex' : 'зыд|зы|зош|озше|озшед',
	'flex' : '2ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	3л+$A0*	4л+ъ	ый/я/яй	ущ+$A1sx	5+$A1sh	-	ен+$A1n*'
	},
'Vizyti' : {
	'type' : 'V',
	'core' : r'(.*)(ы)()(ти)',
	'inflex' : 'ыд|ы|ош|ше|шед',
	'flex' : '2ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	3л+$A0*	4л+ъ	ый/я/яй	ущ+$A1sx	5+$A1sh	-	ен+$A1n*'
	},
'Vizjiti' : {
	'type' : 'V',
	'core' : r'(.*)(ъи)()(ти)',
	'inflex' : 'ъид|ъи|ош|ше|шед',
	'flex' : '2ти	у	еши	етъ	емъ	ете	утъ	ев+$V0	ет+$V0	и	ите	имъ/емъ	ив+$V0/ев+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	3л+$A0*	4л+ъ	ый/я/яй	ущ+$A1sx	5+$A1sh	-	ен+$A1n*'
	},
'Vexat' : {
	'type' : 'V',
	'core' : r'(.*)(ха)()(ти)',
	'inflex' : 'ха|д',
	'flex' : 'ти	2у	2еши	2етъ	2емъ	2ете	2утъ	2ев+$V0	2ет+$V0	2и	2ите	2имъ/2емъ	2ив+$V0/2ев+$V0	2ит+$V0	2яхъ	2яше	2яхомъ	2ясте	2яху	2яхов+$V0	2яст+$V0	хъ	#	хомъ	сте	ша	хов+$V0	ст+$V0	л+$A0	-	2ый	2ущ+$A1sx	в+$A1sh	-	-'
	},
'Vdat' : {
	'type' : 'V',
	'core' : r'(.*)()()(ти)',
	'inflex' : '',
	'flex' : 'ти	мъ	си	стъ	мъ/мы	сте	дутъ/дятъ	в+$V0	ст+$V0	ждь/й	дите/йте	димъ	див+$V0	дит+$V0	-	-	-	-	-	-	-	хъ	#/де	хомъ	сте	ша/доша	хов+$V0	ст+$V0	л+$A0	-	-	-	в+$A1sh	-	н+$A1n*'
	},
'Vest' : {
	'type' : 'V',
	'core' : r'(.*)()()(сти)',
	'inflex' : 'д|',
	'flex' : '2сти	2мъ	2си	2стъ/2сть	2мы	2сте	ятъ	2в+$V0	2ст+$V0	2ждь	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	охъ	е	охомъ	осте	оша	охов+$V0	ост+$V0	2л+$A0	-	ый	ущ+$A1sx	#+$A1sh	ом+$A1t	ен+$A1n*'
	},
'Vved' : {
	'type' : 'V',
	'core' : r'(.*)(д)()(ѣти)',
	'inflex' : 'д|',
	'flex' : 'ѣти	2мъ	2си	2сть	2мы	2сте	ятъ	2в+$V0	2ст+$V0	2ждь	ите	имъ	ив+$V0	ит+$V0	яхъ	яше	яхомъ	ясте	яху	яхов+$V0	яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	ый	ущ+$A1sx/ящ+$A1sx	ѣв+$A1sh	ом+$A1t	ѣн+$A1n*'
	},
'Vima' : {
	'type' : 'V',
	'core' : r'(.*)()()(ѣти)',
	'inflex' : '',
	'flex' : 'ѣти	амъ	аши	атъ/ать	амы	ате	утъ	ав+$V0	ат+$V0	-	-	-	-	-	-	-	-	-	-	-	-	-	-	-	-	-	-	-	-	-	ый	ущ+$A1sx	-	-	-'
	},
'Vime' : {
	'type' : 'V',
	'core' : r'(.*)()()(ти)',
	'inflex' : '',
	'flex' : 'ти	ю	еши	етъ	емъ	ете	ютъ	ев+$V0	ет+$V0	ѣй	ѣйте	ѣимъ	ѣив+$V0	ѣит+$V0	ѣяхъ/яхъ	ѣяше/яше	ѣяхомъ/яхомъ	ѣясте/ясте	ѣяху/яху	ѣяхов+$V0/яхов+$V0	ѣяст+$V0/яст+$V0	ѣхъ	ѣ	ѣхомъ	ѣсте	ѣша	ѣхов+$V0	ѣст+$V0	ѣл+$A0	-	ѣя/ѣяй	ѣющ+$A1sx	ѣв+$A1sh	-	-'
	},
'Vsum' : {
	'type' : 'V',
	'core' : r'(.*)()()(быти)',
	'inflex' : '',
	'flex' : 'бы+ти	ес+мь	ес+и	ес+ть	ес+мы	ес+те	су+ть	ес+в+$V0	ес+т+$V0	буд+и	буд+ите	буд+имъ/емъ	буд+ив+$V0/ев+$V0	буд+ит+$V0	бя+хъ	бя+ше	бя+хомъ	бя+сте	бя+ху	бя+хов+$V0	бя+ст+$V0	бѣ+хъ	бѣ	бѣ+хомъ	бѣ+сте	бѣ+ша	бѣ+хов+$V0	бѣ+ст+$V0	был+$A0	-	с+ый	с+ущ+$A1sx	бы+в+$A1sh	-	-'
	},
'Vero' : {
	'type' : 'V',
	'core' : r'(.*)()()(быти)',
	'inflex' : '',
	'flex' : 'бы+ти	буд+у	буд+еши	буд+етъ	буд+емъ	буд+ете	буд+утъ	буд+ев+$V0	буд+ет+$V0	буд+и	буд+ите	буд+имъ/емъ	буд+ив+$V0/ев+$V0	буд+ит+$V0	-	-	-	-	-	-	-	бы+хъ	бы/бысть	бы+хомъ	бы+сте	бы+ша	бы+хов+$V0	бы+ст+$V0	был+$A0	-	-	-	бы+в+$A1sh	-	быт+$A1t/бвен+$A1n*'
	},
}

def match_word(word, paradigm):
    if re.match(word, paradigms[paradigm]['core']):
        return True

def generate_forms(word, paradigm):
    #print (word)
    forms = {}
    paradigm_head = paradigm_types[paradigms[paradigm]['type']].split('\t') # list of grammatical forms relevant for variable "paradigm"
    inflices = paradigms[paradigm]['inflex'].split('|') # list of inflexes relevant for variable "paradigm"
    for gramm_form, endings in zip(paradigm_head, paradigms[paradigm]['flex'].split('\t')):
        endings = endings.split('/') # list of flexes possible for a single grammatical form
        variants = len(endings) 
        for variant_no, ending in enumerate(endings, 1): 
            do_update = True
            if re.match(r'^=.*', ending):
                form = ending
            elif re.match('^-$', ending):
            	form = ending
            elif re.match(r'^[1-9].*', ending):
                inflex_no = int(ending[0]) - 1
                ending = ending[1:]
                form = re.sub(paradigms[paradigm]['core'], r'\1' +
                              inflices[inflex_no] + r'\3' + ending, word)
            elif re.search('\$', ending):
                subparadigm = re.split(r'(\+\$|\$)', ending)
                subword = re.sub(paradigms[paradigm]['core'], r'\1' +
                              inflices[0] + r'\3' + subparadigm[0], word)
                subforms = generate_forms(subword, subparadigm[2])
                #print (subword)
                #print (subparadigm[2])
                #print (subforms)
                for subgramm, subform in subforms.items():
                    forms.update({gramm_form+'+'+subgramm : subform})
                do_update = False 
            else:
                form = re.sub(paradigms[paradigm]['core'], r'\1' +
                              inflices[0] + r'\3' + ending, word)
            if variants > 1:
                gramm = gramm_form + ".%d" % variant_no
            else:
                gramm = gramm_form
            if do_update:
                forms.update({gramm: form})
    return forms

def generate_forms_and_print(word, paradigm):
    forms = generate_forms(word, paradigm)
    for gramm, form in forms.items():
        print('%s %s' % (gramm.ljust(20), form))

#control_words:

# forms = generate_forms_and_print("рабъ", 'N1t')
#forms = generate_forms_and_print("оселъ", 'N1t*-a')
#forms = generate_forms_and_print("оселъ", 'N1t*-a')
#forms = generate_forms_and_print("молебенъ", 'N1t*-a')
#forms = generate_forms_and_print("хребетъ", 'N1t*-a')
#forms = generate_forms_and_print("левъ", 'N1t*-b')
#forms = generate_forms_and_print("посолъ", 'N1t*-c')
#forms = generate_forms_and_print("конь","N1j")
#forms = generate_forms_and_print("царь","N1j")
#forms = generate_forms_and_print("перстень","N1j*-a")
#forms = generate_forms_and_print("комель","N1j*-a")
#forms = generate_forms_and_print("лакоть","N1j*-b")
#forms = generate_forms_and_print("огонь","N1j*-b")
#forms = generate_forms_and_print("угорь","N1j*-b")
#forms = generate_forms_and_print("уголь","N1j*-b")
#forms = generate_forms_and_print("мытарь","N1je")
#forms = generate_forms_and_print("делатель","N1je")
#forms = generate_forms_and_print("отрокъ","N1k")
#forms = generate_forms_and_print("врагъ","N1g")
#forms = generate_forms_and_print("духъ","N1h")
#forms = generate_forms_and_print("свитокъ","N1k*-a")
#forms = generate_forms_and_print("кулекъ","N1k*-b")
#forms = generate_forms_and_print("раекъ","N1k*-c")
#forms = generate_forms_and_print("мужъ","N1s")
#forms = generate_forms_and_print("кошъ","N1s")
#forms = generate_forms_and_print("врачь","N1sj")
#forms = generate_forms_and_print("плащь","N1sj")
#forms = generate_forms_and_print("мертвецъ","N1c")
#forms = generate_forms_and_print("месяцъ","N1c")
#forms = generate_forms_and_print("отецъ","N1c*-a")
#forms = generate_forms_and_print("боецъ","N1c*-b")
#forms = generate_forms_and_print("телецъ","N1c*-c")
#forms = generate_forms_and_print("край","N1a")
#forms = generate_forms_and_print("алой","N1a")
#forms = generate_forms_and_print("агапiй","N1i")
#forms = generate_forms_and_print("любодѣй","N1i")
#forms = generate_forms_and_print("iерей","N1e")
#forms = generate_forms_and_print("галилеанинъ","N1in")
#forms = generate_forms_and_print("село","N2t")
#forms = generate_forms_and_print("окно","N2t*-a")
#forms = generate_forms_and_print("весло","N2t*-b")
#forms = generate_forms_and_print("письмо","N2t*-c")
#forms = generate_forms_and_print("море","N2j")
#forms = generate_forms_and_print("поле","N2j")
#forms = generate_forms_and_print("облако","N2k")
#forms = generate_forms_and_print("плече","N2s")
#forms = generate_forms_and_print("жилище","N2s")
#forms = generate_forms_and_print("ложе","N2s")
#forms = generate_forms_and_print("солнце","N2c")
#forms = generate_forms_and_print("сердце","N2c*-a")
#forms = generate_forms_and_print("кольце","N2c*-b")
#forms = generate_forms_and_print("знаменiе","N2i")
#forms = generate_forms_and_print("еѵангелiе","N2e")
#forms = generate_forms_and_print("жена","N3t")
#forms = generate_forms_and_print("гривна","N3t*-a")
#forms = generate_forms_and_print("судьба","N3t*-b")
#forms = generate_forms_and_print("неделя","N3j")
#forms = generate_forms_and_print("земля","N3j*")
#forms = generate_forms_and_print("рука","N3k")
#forms = generate_forms_and_print("нога","N3g")
#forms = generate_forms_and_print("муха","N3h")
#forms = generate_forms_and_print("егѵптянка","N3k*-a")
#forms = generate_forms_and_print("чайка","N3k*-b")
#forms = generate_forms_and_print("банька","N3k*-c")
#forms = generate_forms_and_print("юноша","N3s")
#forms = generate_forms_and_print("улица","N3c")
#forms = generate_forms_and_print("овца","N3c*-a")
#forms = generate_forms_and_print("пыльца","N3c*-b")
#forms = generate_forms_and_print("байца","N3c*-c")
#forms = generate_forms_and_print("стая","N3a")
#forms = generate_forms_and_print("солея","N3i")
#forms = generate_forms_and_print("літургіа","N3e")
#forms = generate_forms_and_print("милость","N41")
#forms = generate_forms_and_print("путь","N42")
#forms = generate_forms_and_print("камень","N43")
#forms = generate_forms_and_print("день","N43*")
#forms = generate_forms_and_print("имя","N5en")
#forms = generate_forms_and_print("осля","N5et")
#forms = generate_forms_and_print("отроча","N5at")
#forms = generate_forms_and_print("небо","N5bes")
#forms = generate_forms_and_print("ухо","N5hes")
#forms = generate_forms_and_print("мати","N5er")
#forms = generate_forms_and_print("свекры","N5ov")
#forms = generate_forms_and_print("церковь","N5*ov")
#forms = generate_forms_and_print("делавъ","A1sh*")
#forms = generate_forms_and_print("несъ","A1sh*")
#forms = generate_forms_and_print("любль","A1sh*")
#forms = generate_forms_and_print("творь","A1sh*")
forms = generate_forms_and_print("мудрый","A1t")
#forms = generate_forms_and_print ("умный","A1t*-a")
#forms = generate_forms_and_print ("вольный","A1t*-b")
#forms = generate_forms_and_print ("буйный","A1t*-c")
#forms = generate_forms_and_print ("достойный","A1t*-d")
#forms = generate_forms_and_print ("светлый","A1t*-e")
#forms = generate_forms_and_print ("раненный","A1n*")
#forms = generate_forms_and_print ("синій","A1j")
#forms = generate_forms_and_print ("древній","A1j*-a")
#forms = generate_forms_and_print ("дальній","A1j*-b")
#forms = generate_forms_and_print ("великiй","A1k")
#forms = generate_forms_and_print ("адскій","A1k")
#forms = generate_forms_and_print ("галицкій","A1k")
#forms = generate_forms_and_print ("благій","A1n*")
#forms = generate_forms_and_print ("тихій","A1n*")
#forms = generate_forms_and_print ("рѣдкій","A1n*")
#forms = generate_forms_and_print ("тяжкій","A1n*")
#forms = generate_forms_and_print ("горькій","A1n*")
#forms = generate_forms_and_print ("бойкій","A1n*")
#forms = generate_forms_and_print ("бывшій","A1n*")
#forms = generate_forms_and_print ("нищій","A1n*")
#forms = generate_forms_and_print ("горячій","A1n*")
#forms = generate_forms_and_print ("свѣжій","A1n*")
#forms = generate_forms_and_print ("несущ","A1n*")
#forms = generate_forms_and_print ("буій","A1n*")
#forms = generate_forms_and_print ("велій","A1n*")
#forms = generate_forms_and_print ("авраамовъ","A1n*")
#forms = generate_forms_and_print ("авраамль","A1n*")
#forms = generate_forms_and_print ("господній","A1n*")
#forms = generate_forms_and_print ("агнчій","A1n*")
#forms = generate_forms_and_print ("инъ","A1n*")
#forms = generate_forms_and_print ("всякъ","A1n*")
#forms = generate_forms_and_print ("той","A1n*")
#forms = generate_forms_and_print ("сей","A1n*")
#forms = generate_forms_and_print ("весь","A1n*")
#forms = generate_forms_and_print ("кій","A1n*")
#forms = generate_forms_and_print ("нашъ","A1n*")
#forms = generate_forms_and_print ("мой","A1n*")
#forms = generate_forms_and_print ("и","A1n*")
#forms = generate_forms_and_print ("иже","A1n*")
#forms = generate_forms_and_print ("азъ","A1n*")
#forms = generate_forms_and_print ("ты","A1n*")
#forms = generate_forms_and_print ("себе","A1n*")
#forms = generate_forms_and_print ("мы","A1n*")
#forms = generate_forms_and_print ("кто","A1n*")
#forms = generate_forms_and_print ("что","A1n*")
#forms = generate_forms_and_print ("два","A1n*")
#forms = generate_forms_and_print ("оба","A1n*")
#forms = generate_forms_and_print ("три","A1n*")
#forms = generate_forms_and_print ("четыре","A1n*")
#forms = generate_forms_and_print ("пять","A1n*")
#forms = generate_forms_and_print ("десять","A1n*")
#forms = generate_forms_and_print ("сто","A1n*")
#forms = generate_forms_and_print ("двое","A1n*")
#forms = generate_forms_and_print ("четверы","A1n*")
#forms = generate_forms_and_print ("ходилъ","A1n*")
#forms = generate_forms_and_print ("шелъ","A1n*")
#forms = generate_forms_and_print ("творити","A1n*")
#forms = generate_forms_and_print ("строити","A1n*")
#forms = generate_forms_and_print ("рѣшити","A1n*")
#forms = generate_forms_and_print ("купити","A1n*")
#forms = generate_forms_and_print ("любити","A1n*")
#forms = generate_forms_and_print ("ловити","A1n*")
#forms = generate_forms_and_print ("кормити","A1n*")
#forms = generate_forms_and_print ("умертвити","A1n*")
#forms = generate_forms_and_print ("мыслити","A1n*")
#forms = generate_forms_and_print ("родити","A1n*")
#forms = generate_forms_and_print ("твердити","A1n*")
#forms = generate_forms_and_print ("свѣтити","A1n*")
#forms = generate_forms_and_print ("млатити","A1n*")
#forms = generate_forms_and_print ("носити","A1n*")
#forms = generate_forms_and_print ("возити","A1n*")
#forms = generate_forms_and_print ("пустити","A1n*")
#forms = generate_forms_and_print ("гвоздити","A1n*")
#forms = generate_forms_and_print ("велѣти","A1n*")
#forms = generate_forms_and_print ("терпѣти","A1n*")
#forms = generate_forms_and_print ("скорбѣти","A1n*")
#forms = generate_forms_and_print ("шумѣти","A1n*")
#forms = generate_forms_and_print ("видѣти","A1n*")
#forms = generate_forms_and_print ("летѣти","A1n*")
#forms = generate_forms_and_print ("вертѣти","A1n*")
#forms = generate_forms_and_print ("висѣти","A1n*")
#forms = generate_forms_and_print ("свистѣти","A1n*")
#forms = generate_forms_and_print ("слышати","A1n*")
#forms = generate_forms_and_print ("стояти","A1n*")
#forms = generate_forms_and_print ("дѣлати","A1n*")
#forms = generate_forms_and_print ("краснѣти","A1n*")
#forms = generate_forms_and_print ("требовати","A1n*")
#forms = generate_forms_and_print ("непщевати","A1n*")
#forms = generate_forms_and_print ("утреневати","A1n*")
#forms = generate_forms_and_print ("глаголати","A1n*")
#forms = generate_forms_and_print ("сыпати","A1n*")
#forms = generate_forms_and_print ("колебати","A1n*")
#forms = generate_forms_and_print ("дремати","A1n*")
#forms = generate_forms_and_print ("имати","A1n*")
#forms = generate_forms_and_print ("отымати","A1n*")
#forms = generate_forms_and_print ("ставати","A1n*")
#forms = generate_forms_and_print ("страдати","A1n*")
#forms = generate_forms_and_print ("клеветати","A1n*")
#forms = generate_forms_and_print ("шептати","A1n*")
#forms = generate_forms_and_print ("ристати","A1n*")
#forms = generate_forms_and_print ("писати","A1n*")
#forms = generate_forms_and_print ("мазати","A1n*")
#forms = generate_forms_and_print ("алкати","A1n*")
#forms = generate_forms_and_print ("плескати","A1n*")
#forms = generate_forms_and_print ("лгати","A1n*")
#forms = generate_forms_and_print ("махати","A1n*")
#forms = generate_forms_and_print ("рицати","A1n*")
#forms = generate_forms_and_print ("здати","A1n*")
#forms = generate_forms_and_print ("звиздати","A1n*")
#forms = generate_forms_and_print ("даяти","A1n*")
#forms = generate_forms_and_print ("рвати","A1n*")
#forms = generate_forms_and_print ("брати","A1n*")
#forms = generate_forms_and_print ("вобрати","A1n*")
#forms = generate_forms_and_print ("звати","A1n*")
#forms = generate_forms_and_print ("отозвати","A1n*")
#forms = generate_forms_and_print ("гнати","A1n*")
#forms = generate_forms_and_print ("ринути","A1n*")
#forms = generate_forms_and_print ("гибнути","A1n*")
#forms = generate_forms_and_print ("двигнути","A1n*")
#forms = generate_forms_and_print ("меркнути","A1n*")
#forms = generate_forms_and_print ("издхнути","A1n*")
#forms = generate_forms_and_print ("нести","A1n*")
#forms = generate_forms_and_print ("мести","A1n*")
#forms = generate_forms_and_print ("красти","A1n*")
#forms = generate_forms_and_print ("гребсти","A1n*")
#forms = generate_forms_and_print ("расти","A1n*")
#forms = generate_forms_and_print ("чести","A1n*")
#forms = generate_forms_and_print ("счести","A1n*")
#forms = generate_forms_and_print ("сѣсти","A1n*")
#forms = generate_forms_and_print ("обрѣсти","A1n*")
#forms = generate_forms_and_print ("пещи","A1n*")
#forms = generate_forms_and_print ("брещи","A1n*")
#forms = generate_forms_and_print ("жещи","A1n*")
#forms = generate_forms_and_print ("врещи","A1n*")
#forms = generate_forms_and_print ("лещи","A1n*")
#forms = generate_forms_and_print ("жрети","A1n*")
#forms = generate_forms_and_print ("терти","A1n*")
#forms = generate_forms_and_print ("клати","A1n*")
#forms = generate_forms_and_print ("брати","A1n*")
#forms = generate_forms_and_print ("млети","A1n*")
#forms = generate_forms_and_print ("бити","A1n*")
#forms = generate_forms_and_print ("мыти","A1n*")
#forms = generate_forms_and_print ("обути","A1n*")
#forms = generate_forms_and_print ("пѣти","A1n*")
#forms = generate_forms_and_print ("яти","A1n*")
#forms = generate_forms_and_print ("отъяти","A1n*")
#forms = generate_forms_and_print ("взяти","A1n*")
#forms = generate_forms_and_print ("вняти","A1n*")
#forms = generate_forms_and_print ("наяти","A1n*")
#forms = generate_forms_and_print ("мяти","A1n*")
#forms = generate_forms_and_print ("жати","A1n*")
#forms = generate_forms_and_print ("жати","A1n*")
#forms = generate_forms_and_print ("кляти","A1n*")
#forms = generate_forms_and_print ("дути","A1n*")
#forms = generate_forms_and_print ("стати","A1n*")
#forms = generate_forms_and_print ("дѣти","A1n*")
#forms = generate_forms_and_print ("дѣти","A1n*")
#forms = generate_forms_and_print ("жити","A1n*")
#forms = generate_forms_and_print ("плыти","A1n*")
#forms = generate_forms_and_print ("слути","A1n*")
#forms = generate_forms_and_print ("спати","A1n*")
#forms = generate_forms_and_print ("хотѣти","A1n*")
#forms = generate_forms_and_print ("ревѣти","A1n*")
#forms = generate_forms_and_print ("ити","A1n*")
#forms = generate_forms_and_print ("найти","A1n*")
#forms = generate_forms_and_print ("взыти","A1n*")
#forms = generate_forms_and_print ("изыти","A1n*")
#forms = generate_forms_and_print ("изъити","A1n*")
#forms = generate_forms_and_print ("ѣхати","A1n*")
#forms = generate_forms_and_print ("дати","A1n*")
#forms = generate_forms_and_print ("ясти","A1n*")
#forms = generate_forms_and_print ("вѣдѣти","A1n*")
#forms = generate_forms_and_print ("им+ѣти","A1n*")
#forms = generate_forms_and_print ("им+ѣти","A1n*")
#forms = generate_forms_and_print ("имати","A1n*")
#forms = generate_forms_and_print ("быти","A1n*")
#forms = generate_forms_and_print ("быти","A1n*")